{"meta":{"title":"Technocracy","subtitle":"Posts on whatever your host deems relevant.","description":null,"author":"Eric Simmerman","url":"http://ericsimmerman.com"},"pages":[{"title":"about me","date":"2016-06-21T03:03:23.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"about/index.html","permalink":"http://ericsimmerman.com/about/index.html","excerpt":"","text":"I work hereI built thisI founded thisI blog hereI code here and here My LinkedIn ProfileMy GPG Key Content DiscoverySome of my favorite sources - in no particular order: Marginal Revolution Aeon.co Edge.org Wait but Why Stratechery The Atlantic Quillette Rands in Repose LessWrong Nautilus Science Research Network Insipiration What You’ll Wish You’d Known My Meditation Collection"},{"title":"meditation","date":"2017-12-10T04:03:23.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"about/meditation.html","permalink":"http://ericsimmerman.com/about/meditation.html","excerpt":"","text":"Meditation Until you make the unconscious conscious, it will direct your life and you will call it fate. ― C.G. Jung The world is the totality of facts, not of things. ― Ludwig Wittgenstein You must never confuse faith that you will prevail in the end – which you cannot afford to lose – with the discipline to confront the most brutal facts of your current reality,whatever they might be. ― James Bond Stockdale “Tis a Fearful Thing‘Tis a fearful thingto love what death can touch.A fearful thingto love, to hope, to dream, to be –to be,And oh, to lose.A thing for fools, this,And a holy thing,a holy thingto love.For your life has lived in me,your laugh once lifted me,your word was gift to me.To remember this brings painful joy.‘Tis a human thing, love,a holy thing, to lovewhat death has touched.”― Yehuda HaLevi"}],"posts":[{"title":"Granting a new user permissions on RDS Maria/Mysql","slug":"Granting-a-new-user-permissions-on-RDS-Maria-Mysql","date":"2019-03-11T00:48:13.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2019/03/10/Granting-a-new-user-permissions-on-RDS-Maria-Mysql/","link":"","permalink":"http://ericsimmerman.com/2019/03/10/Granting-a-new-user-permissions-on-RDS-Maria-Mysql/","excerpt":"","text":"You cannot use GRANT ALL for any user on an Amazon AWS RDS instance of Mysql/Maria (Aurora Mysql). When you use the GRANT ALL statement you are also attempting to provide Global Super Permissions such as File and this is not allowed on AWS RDS. So you need to break out the permissions instead of using GRANT ALL. As of this writing, the most you can grant are: SELECT, INSERT, UPDATE, DELETE, CREATE, DROP, REFERENCES, INDEX, ALTER, CREATE TEMPORARY TABLES, LOCK TABLES, EXECUTE, CREATE VIEW, SHOW VIEW, CREATE ROUTINE, ALTER ROUTINE, EVENT, TRIGGER Using them in a statement such as: GRANT SELECT, INSERT, UPDATE, DELETE, CREATE, DROP, REFERENCES, INDEX, ALTER, CREATE TEMPORARY TABLES, LOCK TABLES, EXECUTE, CREATE VIEW, SHOW VIEW, CREATE ROUTINE, ALTER ROUTINE, EVENT, TRIGGER ON my_database . * TO ‘my_user‘@’localhost’;","categories":[],"tags":[]},{"title":"DRY in MS Word on a Mac","slug":"DRY-in-MS-Word-on-a-Mac","date":"2018-11-09T21:19:04.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2018/11/09/DRY-in-MS-Word-on-a-Mac/","link":"","permalink":"http://ericsimmerman.com/2018/11/09/DRY-in-MS-Word-on-a-Mac/","excerpt":"","text":"Lucky me had the opportunity to review &amp; adopt 60+ HITRUST policies for HealthPrize this week. My friendly outside council delivered the policies as individual MS Word documents. So to make the process of inserting our logo, stamping the adoption date, and generally modifying the boilerplate to fit our needs I decided to apply a little macro magic. YMMV:12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758Sub HPTPolicies()&apos;&apos; HPTPolicies Macro&apos;&apos; With Selection .HomeKey Unit:=wdStory With .Find .ClearFormatting .Text = &quot;[[INSERT LOGO]]&quot; Do While .Execute Selection.MoveRight Selection.InlineShapes.AddPicture fileName:=&quot;/Volumes/mydrive/afolder/HPTlogo.png&quot;, LinkToFile:=False, SaveWithDocument:=True Loop End With End With With Selection .HomeKey Unit:=wdStory With .Find .ClearFormatting .Text = &quot;[[INSERT LOGO]]&quot; Do While .Execute Selection.Delete Loop End With End With Selection.Find.ClearFormatting Selection.Find.Replacement.ClearFormatting With Selection.Find .Text = &quot;[Insert Title Appointed Person]&quot; .MatchCase = True .Replacement.Text = &quot;Chief Technology Officer&quot; End With Selection.Find.Execute Replace:=wdReplaceAll Selection.Find.ClearFormatting Selection.Find.Replacement.ClearFormatting With Selection.Find .Text = &quot;[Insert Title of `Appointed Person]&quot; .MatchCase = True .Replacement.Text = &quot;Chief Technology Officer&quot; End With Selection.Find.Execute Replace:=wdReplaceAll Selection.Find.ClearFormatting Selection.Find.Replacement.ClearFormatting With Selection.Find .Text = &quot;ADD DATE&quot; .MatchCase = True .Replacement.Text = &quot;November 9, 2018&quot; End With Selection.Find.Execute Replace:=wdReplaceAll Selection.Find.ClearFormatting Selection.Find.Replacement.ClearFormatting With ActiveDocument.ActiveWindow.View .Type = wdPrintView .Zoom.Percentage = 250 End WithEnd Sub","categories":[],"tags":[]},{"title":"Setting up a Bastion host on AWS","slug":"2017-05-01-setting-up-bastion-host-aws","date":"2017-05-18T21:01:41.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2017/05/18/2017-05-01-setting-up-bastion-host-aws/","link":"","permalink":"http://ericsimmerman.com/2017/05/18/2017-05-01-setting-up-bastion-host-aws/","excerpt":"","text":"When setting up my latest development environment at AWS, I wanted to deploy all EC2 services on a private VPC and simply route all traffic to them through a Bastion host (aka jump host). AWS maintains a an excellent CloudFormation quickstart guide &amp; template here and it’s what I used to get started. After completing that guide I put a new entry for the Bastion host in my ssh config like so:123456Host bastion Hostname ec2-XX-XXX-XXX-XXX.compute-1.amazonaws.com User ec2-user IdentityFile ~/path/to/your/ssh-key.pem AddKeysToAgent yes UseKeychain yes Those last two lines are optional - but I like to leverage the Keychain on my MacBookPro for storing keys and their respective passphrases. Accepting the host key into your known_hosts file can avoid some pain going forward, so I recommend connecting directly to the bastion before continuing. To test my setup, I launched a EC2 instance in my private VPC and configured it in my ssh config like so:123456Host 10.100.*.* ProxyCommand ssh ec2-user@bastion -W %h:%p User ec2-user IdentityFile ~/path/to/your/ssh-key.pem AddKeysToAgent yes UseKeychain yes The magic happens on the second line with the ProxyCommand instructing SSH to jump through Bastion to route to any of the private IP addresses used in my development environment VPC. Unfortunately, my first attempt to connect failed. I poked around in the Bastion’s SSHD config and realized that the CloudFront template was so hardened that it wasn’t going to support the transparent sessions I wanted. I needed to modify /etc/ssh/sshd_config and add the following just below the PAM section:12PermitOpen anyAllowTCPForwarding yes After making the change be certain to restart the sshd service on Bastion. Part of the beauty of the CloudFormation design is that it uses an AutoScaling group to automatically tear down unresponsive Bastions and spin up replacements - even adapting to availability zone issues. When that happens the replacement Bastion will be configured with template defaults, so to ensure my sshd_config change would survive a failover, I copied the LaunchConfig and edited the user data to include the following:1perl -pi -0 -w -e &apos;s/UsePAM yes/UsePam yes\\n\\n# Added by ets to support transparent pass through\\nPermitOpen any\\nAllowTCPForwarding yes/&apos; sshd_config Then I replaced the currently configured LaunchConfig on my AutoScaling group with my copy. Now simply asking SSH to connect to my new services in the private VPC worked transparently!To make session more efficient using this type of proxy, I added the following to my Bastion host entry in ssh config:123ControlPath ~/.ssh/cm-%r@%h:%pControlMaster autoControlPersist 10m If you’re an ansible fan like me, you can take advantage of that same technique with a change to ansible.cfg:12ssh_args = -o ControlMaster=auto -o ControlPersist=30mcontrol_path = ~/.ssh/ansible-%%r@%%h:%%p If you’re curious how to further protect your Bastion host with a whitelist for port 22 while also supporting users who are behind dynamic IPs then you’ll want to check out my aws-lambda-firewall project.","categories":[],"tags":[{"name":"AWS","slug":"AWS","permalink":"http://ericsimmerman.com/tags/AWS/"},{"name":"bastion","slug":"bastion","permalink":"http://ericsimmerman.com/tags/bastion/"},{"name":"jumphost","slug":"jumphost","permalink":"http://ericsimmerman.com/tags/jumphost/"}]},{"title":"Knock first firewall for AWS Security Groups","slug":"2017-05-16-aws-lambda-firewall","date":"2017-05-17T02:21:53.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2017/05/16/2017-05-16-aws-lambda-firewall/","link":"","permalink":"http://ericsimmerman.com/2017/05/16/2017-05-16-aws-lambda-firewall/","excerpt":"","text":"I recently setup a Bastion host to secure a development environment on AWS. The Bastion only exposes port 22 for SSH and I wanted to restrict access to a whitelist of authorized IP addresses rather than leave port 22 open to the internet. Further - I wanted to restrict 443 and 80 inbound to the development environment so that only authorized users/developers could access the pre-release builds deployed there. But I and others on my team switch IP addresses often and don’t want to hassle with manual manipulation of AWS Security Groups each time I move networks in meatspace. So I threw together a “knock for access” firewall using API Gateway &amp; lambda to conveniently add and expire authorized IP addresses on the applicable Security Groups. Enjoy!","categories":[],"tags":[{"name":"AWS","slug":"AWS","permalink":"http://ericsimmerman.com/tags/AWS/"},{"name":"AWS lambda","slug":"AWS-lambda","permalink":"http://ericsimmerman.com/tags/AWS-lambda/"},{"name":"AWS API Gateway","slug":"AWS-API-Gateway","permalink":"http://ericsimmerman.com/tags/AWS-API-Gateway/"}]},{"title":"Social Tables Retrospective","slug":"2017-01-23-Social-Tables-Retrospective","date":"2017-01-23T16:29:10.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2017/01/23/2017-01-23-Social-Tables-Retrospective/","link":"","permalink":"http://ericsimmerman.com/2017/01/23/2017-01-23-Social-Tables-Retrospective/","excerpt":"","text":"My last post was over a year and a half ago - just after I joined an interesting Bessemer Ventures backed firm in the Hospitality sector called Social Tables.My role here has been 95% people / 5% tech and always intense. I’m retroactively posting some of the internal content I circulated as the technology leader at Social Tables - mostly high-level explanations of what my team was up to at the time. It’s been a fun ride with unique challenges and as I move on to my next post, I wanted to capture a few takeaways for posterity: Avoid greenfield rewrites of established applications. Specifics may warrant a true rewrite - but recognize the extreme risk to all involved if that’s the selected path. While I certainly agree with what Joel says about this here, I’ll add one more point of support - that a rewrite is a fight on two fronts. It’s up against the formidable foes of customer adoption of a new thing and the golden project phenomenon - where a golden (too big to fail) project’s scope continually increases without bound. Hire for squads and fire quickly on non-fit. My worst HR calls at Social Tables involved attempts to reassign an employee to a different team in an attempt to establish fit. This is especially difficult where the employee in question was inherited as opposed to hired under my watch. There’s a strong desire to give the inherited employee multiple chances to demonstrate fit. Don’t do it - if the employee is not a good enough for the first team she joins (or is assigned to) then do her and the rest of the team a favor - cut her loose with dignity. Such an evaluation might rightly not be considered fair - c’est la vie. Adopt 2-3 cutting-edge technologies, but no more. This worked really well for us - especially on the recruiting tip. Our best hires came through our broadcast of niche (at the time) tech such as WebGL, React, and RethinkDB. But it’s a double-edged sword. Our worst tech adoption failures came from naive pushes into Falcor, Dynamo, and Horizon. Onward &amp; Upward!","categories":[],"tags":[{"name":"AWS","slug":"AWS","permalink":"http://ericsimmerman.com/tags/AWS/"},{"name":"bastion","slug":"bastion","permalink":"http://ericsimmerman.com/tags/bastion/"},{"name":"jumphost","slug":"jumphost","permalink":"http://ericsimmerman.com/tags/jumphost/"}]},{"title":"Explaining Docker to suits","slug":"2016-03-22-Explaining-Docker-to-Suits","date":"2016-05-14T23:18:04.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2016/05/14/2016-03-22-Explaining-Docker-to-Suits/","link":"","permalink":"http://ericsimmerman.com/2016/05/14/2016-03-22-Explaining-Docker-to-Suits/","excerpt":"","text":"I posted the following on an internal blog at Social Tables in an attempt to explain a bit about what our Software Engineering group was up to at the time. What’s Docker you say? Glad you asked… What’s Docker?Docker’s a technology that allows us to wrap our applications &amp; services as self-contained deliverables that are isolated from the host operating system upon which they are deployed. What’s Docker … in English (preferably with pictures)?So…visualize a long-haul shipping container. Appreciate how much easier it makes moving cargo between ship, train, and truck. In a similar way, Docker helps us package our software into shipping containers and we can then run that software unchanged on a laptop, a dedicated server, or a cloud platform. So that’s a good thing?Yes. Plus Docker’s mascot is a cute whale.","categories":[],"tags":[{"name":"Docker","slug":"Docker","permalink":"http://ericsimmerman.com/tags/Docker/"}]},{"title":"Explaining Query Tuning to suits","slug":"2016-04-20-Explaining-Query-Tuning-to-Suits","date":"2016-04-20T23:18:04.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2016/04/20/2016-04-20-Explaining-Query-Tuning-to-Suits/","link":"","permalink":"http://ericsimmerman.com/2016/04/20/2016-04-20-Explaining-Query-Tuning-to-Suits/","excerpt":"","text":"I posted the following on an internal blog at Social Tables in an attempt to explain a bit about what our Software Engineering group was up to at the time. Today we’re going to talk briefly about query tuning - a black art in the craft of software engineering that predates the Internet but is still incredibly relevant. I don’t mean relevant in the “you should really pay attention to national politics” sense. I mean relevant as in “this can (when done poorly) wreck your whole day.” What’s query tuning?A query is a request for information from a database. It can be as simple as “find the email address of the Social Tables user named Inigo Montoya”, or more complex like “find the ASP of all Social Tables opportunities closed on Fridays that followed a Thursday evening Happy Hour.” Since database structures are complex, in most cases, and especially for not-very-simple queries, the needed data for a query can be collected from a database by accessing it in different ways, through different data-structures, and in different orders. Each different way typically requires different processing time. Processing times of the same query may have large variance, from a fraction of a second to hours, depending on the way selected. The purpose of query tuning, is to find the way to process a given query in minimum time. What’s query tuning … in English (preferably with pictures) and how can it wreck my whole day?Query tuning is an effort to minimize the work performed while answering a query. If done poorly, database queries execute slowly and your application responds slowly. When your application responds slowly bad things happen - like Mary posting a screenshot to #devops (aka your whole day is wrecked). Last week, Michael Dumont spent some time tuning several queries in our platform and his visuals of that effort are worth &gt; 1,000 words: Orange = a measure of platform activityBlue = a measure of how hard the database is working Note: unlike Social Tables’ Engineers, our database refuses to work harder than 100% … so those blue peaks are signs of unhappy Social Tables users. Here are the same measurements after tuning: Happier database === Happier users","categories":[],"tags":[{"name":"query tuning","slug":"query-tuning","permalink":"http://ericsimmerman.com/tags/query-tuning/"}]},{"title":"Explaining SDF to suits","slug":"2016-04-06-Explaining-SDF-to-Suits","date":"2016-04-06T23:18:04.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2016/04/06/2016-04-06-Explaining-SDF-to-Suits/","link":"","permalink":"http://ericsimmerman.com/2016/04/06/2016-04-06-Explaining-SDF-to-Suits/","excerpt":"","text":"I posted the following on an internal blog at Social Tables in an attempt to explain a bit about what our Software Engineering group was up to at the time. We’ve got a special subject this issue to take the edge off that geek-withdrawal : “Drawing Text with Signed Distance Fields” or using SDF text rendering for those in the know. What’s SDF?Signed distance field (SDF) is a technique for rendering bitmap fonts without jagged edges even at high magnifications. It was first introduced in 2007 with this bit of light reading by Valve and couples the use of a bitmap and glyphs with a GLSL shader that can sample and sharpen said glyphs. What’s SDF … in English (preferably with pictures)?So…you know what sounds easy but is really really hard? Drawing legible letters in Venue Mapper. Wait - what? Why’s that hard you ask? Here’s a screenshot of “Social Tables” rendered in 12pt font by Microsoft Word: Completely legible. But here’s that exact same image after I zoom in a few times: Not so great. Possibly legible but if we rendered text like this as users zoom in and out in Venue Mapper we’d have to bundle subscriptions with aspirin. SDF is a technique we’ve just begun using to more efficiently render text in Venue Mapper 3 - it performs better (app is faster) and looks prettier than the techniques we’ve used previously. Here’s a movie of SDF in action in VM3 courtesy of our own Van Drunen.","categories":[],"tags":[{"name":"Signed Distance Fields","slug":"Signed-Distance-Fields","permalink":"http://ericsimmerman.com/tags/Signed-Distance-Fields/"}]},{"title":"MySQL Identifying Blocking Transactions","slug":"2015-08-10-mysql-identifying-blocking-transactions","date":"2015-08-10T16:29:15.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2015/08/10/2015-08-10-mysql-identifying-blocking-transactions/","link":"","permalink":"http://ericsimmerman.com/2015/08/10/2015-08-10-mysql-identifying-blocking-transactions/","excerpt":"","text":"Recording this incredibly helpful query from Bill Karwin’s post to SOYou can find the source query that’s blocking your DELETE by using the INFORMATION_SCHEMA.LOCK_WAITS and INNODB_TRX tables.1234567891011SELECT r.trx_id waiting_trx_id, r.trx_mysql_thread_id waiting_thread, r.trx_query waiting_query, b.trx_id blocking_trx_id, b.trx_mysql_thread_id blocking_thread, b.trx_query blocking_query FROM information_schema.innodb_lock_waits w INNER JOIN information_schema.innodb_trx b ON b.trx_id = w.blocking_trx_id INNER JOIN information_schema.innodb_trx r ON r.trx_id = w.requesting_trx_id; See more information at http://dev.mysql.com/doc/refman/5.5/en/innodb-information-schema.html#innodb-information-schema-examples, under “Example 14.2 Identifying Blocking Transactions”.","categories":[],"tags":[]},{"title":"Fix YAML parsing errors in WebGen","slug":"2015-01-07-fix-yaml-parsing-errors-in-webgen","date":"2015-01-07T17:20:34.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2015/01/07/2015-01-07-fix-yaml-parsing-errors-in-webgen/","link":"","permalink":"http://ericsimmerman.com/2015/01/07/2015-01-07-fix-yaml-parsing-errors-in-webgen/","excerpt":"","text":"After a clean install of Mac OS X Yosemite I’ve had to reinstall much of my development environment. This process was mostly beneficial as I moved to the latest and greatest tooling but several of my static websites leverage the prior major version of Thomas Leitner’s Webgen and getting version 0.5.x up and running has been a challenge. After working through several Ruby &amp; Gem issues I ran into a particularly opaque error when executing webgen on a project that previously generated without issue: “(): found character that cannot start any token while scanning for the next token” This error is usually a sign that your content contains tab characters but I’d already ensured that wasn’t the case. Instead of diving deep into the workings of the libraries at play I was able to use this post from Thomas to resolve the issue by reverting to the syck TAML implementation instead of its replacement. Problem solved!","categories":[],"tags":[]},{"title":"Resolving H2 table lock during JUnitRunner test","slug":"2014-02-01-resolving-h2-table-lock-during-junitrunner-test","date":"2014-02-01T20:36:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2014/02/01/2014-02-01-resolving-h2-table-lock-during-junitrunner-test/","link":"","permalink":"http://ericsimmerman.com/2014/02/01/2014-02-01-resolving-h2-table-lock-during-junitrunner-test/","excerpt":"","text":"After adding a new test to a project that uses Play Framework 1.2.X and thus leverages H2 for Junit functional testing, I began encountering a table lock during setup() when the framework was attempting to delete the contents of an entity table. I initially blamed the lock on bad model design and wasted a significant amount of time tweaking JPA entity relationships and corresponding CRUD operations in an attempt to resolve it. I ultimately resolved the issue after realizing it was in fact caused by a badly designed test. I was directly modifying entities within the transaction that wrapped my functional test and then emulating API calls that relied upon the state of those same entities. Long story short, my test was attempting something similar to this: class FunctionalTest { //Runs entire test in the same transaction setup(){ //reset H2 datastore in an distinct transaction } atest(){ User u = User.findById(1); u.address = new Address(); u.save(); //test continues } btest(){ Request req = GET(&quot;/user/1&quot;); } } In my contrived example above, after Junit runs atest() and just before running btest() - it will call setup() and attempt to reset the database in a separate transaction. But, atest() claimed a lock for insert on User and in H2 that locks the entire table by default thus setup() will be unable to reset the User table and will fail with a lock timeout. To resolve this - you’ll either need to redesign your test to avoid manipulating entities directly in the testcase or run each test in a distinct transaction.","categories":[],"tags":[]},{"title":"Moved again ... this time to github.io","slug":"2013-11-26-moved-again-dot-dot-dot-this-time-to-github-dot-io","date":"2013-11-27T00:22:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2013/11/26/2013-11-26-moved-again-dot-dot-dot-this-time-to-github-dot-io/","link":"","permalink":"http://ericsimmerman.com/2013/11/26/2013-11-26-moved-again-dot-dot-dot-this-time-to-github-dot-io/","excerpt":"","text":"Blogger was just too ugly &amp; clumsy so I used a fork of juniorz’s import.rb to migrate from blogger to Octopress. Here’s my fork: I found MeetDom’s gist helpful while installing all the dependencies required by the import script.","categories":[],"tags":[{"name":"Blogger","slug":"Blogger","permalink":"http://ericsimmerman.com/tags/Blogger/"},{"name":"Octopress","slug":"Octopress","permalink":"http://ericsimmerman.com/tags/Octopress/"}]},{"title":"Plesk 11 Upgrade Unable to run Perl scripts in cgi-bin","slug":"2013-10-29-plesk-11-upgrade-unable-to-run-perl","date":"2013-10-29T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2013/10/29/2013-10-29-plesk-11-upgrade-unable-to-run-perl/","link":"","permalink":"http://ericsimmerman.com/2013/10/29/2013-10-29-plesk-11-upgrade-unable-to-run-perl/","excerpt":"","text":"After an upgrade to Plesk 11, my Perl scripts located under cgi-bin/ for a specific domain were not executing properly. Requests generated HTTP response code 500 and my error logs showed the unhelpful message \"Premature end of script headers\" I verified all permissions and even disabled / re-enabled cgi-bin support through Plesk which installs a test script under cgi-bin/test/test.cgi Even the test script failed to run. It also generated the message \"Premature end of script headers: test.cgi\" I eventually resolved the issue with two changes: The domain's root folder in /var/www/vhosts was not owned by the domain user. So I fixed that with a chown command. Within the Plesk control panel, I had to disable \"Perl\" support and enable \"CGI\" support to get my perl scripts with the \".pl\" extension to run under cgi-bin","categories":[],"tags":[{"name":"perl","slug":"perl","permalink":"http://ericsimmerman.com/tags/perl/"},{"name":"plesk","slug":"plesk","permalink":"http://ericsimmerman.com/tags/plesk/"}]},{"title":"Using iStat 2.x on Mountain Lion","slug":"2013-04-29-using-istat-2x-on-mountain-lion","date":"2013-04-29T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2013/04/29/2013-04-29-using-istat-2x-on-mountain-lion/","link":"","permalink":"http://ericsimmerman.com/2013/04/29/2013-04-29-using-istat-2x-on-mountain-lion/","excerpt":"","text":"Shawn Hooton wrote a piece on how to use iStat 2.x on Mountain Lion that I've used several times at this point. Linking to it here for posterity.","categories":[],"tags":[]},{"title":"Moved to Blogger","slug":"2013-03-07-moved-to-blogger","date":"2013-03-07T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2013/03/07/2013-03-07-moved-to-blogger/","link":"","permalink":"http://ericsimmerman.com/2013/03/07/2013-03-07-moved-to-blogger/","excerpt":"","text":"I started this Agile Answers blog on jroller back in 2006 and I lost some of the older content in my move to Posterous. Sadly Twitter is killing Posterous so I've had to move again...this time to Google's Blogger. Alas - I've lost all the Posterous comments and a lot of formatting in the process. As if&nbsp;The Sean Cook&nbsp;working there weren't reason enough, I now have one more reason to hate Twitter.","categories":[],"tags":[]},{"title":"Compressing MySQL client-server communication with Play Framework","slug":"2012-12-19-compressing-mysql-client-server","date":"2012-12-19T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2012/12/19/2012-12-19-compressing-mysql-client-server/","link":"","permalink":"http://ericsimmerman.com/2012/12/19/2012-12-19-compressing-mysql-client-server/","excerpt":"","text":"FolderGrid provides a RESTful api that often services requests where over 90% of the entire response time is spent pulling data from a MySQL instance. I was recently working to reduce overall response time for some long running transactions in that bucket. After optimizing my queries and my database caching - I looked at network transfer time from the dedicated MySQL server to the mysql client on the application server. &nbsp;Simply enabling MySQL zlib compression resulted in a 3x performance boost for many of the larger resultsets.&nbsp; To configure your Play Framework connection pool to enable MySQL client-server zlib compression, you'll need to use the explicitly defined \"db.url\" instead of the shortcut \"db\" configuration key. Your key should look something like this:db.url=jdbc:mysql://remotehost/dbname?useUnicode=yes&amp;characterEncoding=UTF-8&amp;connectionCollation=utf8_general_ci&amp;useCompression=true&nbsp;&nbsp;","categories":[],"tags":[]},{"title":"When not to front your application with nginx HttpProxyModule","slug":"2012-11-19-when-not-to-front-your-application-with","date":"2012-11-19T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2012/11/19/2012-11-19-when-not-to-front-your-application-with/","link":"","permalink":"http://ericsimmerman.com/2012/11/19/2012-11-19-when-not-to-front-your-application-with/","excerpt":"","text":"Throwing nginx (or Apache or lighthttpd) in front of other application stacks is so common that we often don't think twice about the possible costs. This bit me over the weekend when I casually threw up nginx for SSL termination and configured HttpProxyModule to proxy to my Play Framework driven application.I failed to heed the first section in the HttpProxyModule docs. See that note about how \"the entire client request will be buffered in nginx before being passed on to the backend proxied servers\" ?That's one note you are going to care about when you're handling large requests and can't figure out why your application is so slow to respond to them.RTM&nbsp;&nbsp;&nbsp;","categories":[],"tags":[]},{"title":"Supporting multiple file upload runtimes with pupload inside ExtJS 4","slug":"2012-08-07-supporting-multiple-file-upload","date":"2012-08-07T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2012/08/07/2012-08-07-supporting-multiple-file-upload/","link":"","permalink":"http://ericsimmerman.com/2012/08/07/2012-08-07-supporting-multiple-file-upload/","excerpt":"","text":"The reference client I built for FolderGrid's API is a zero footprint web client created using ExtJS 4. I wanted to support drag &amp; drop file uploads for advanced browsers but degrade nicely all the way back to IE6 for those poor lost souls stuck with tech from the last decade. So I integrated plupload and bound the two together with some jquery glue.The results are working well in production and the client itself is open &amp; licensed under GPL v3 per the terms of ExtJS 4. So if you are interested in copying &amp; extending - have at it.&nbsp;&nbsp;&nbsp;&nbsp;","categories":[],"tags":[]},{"title":"Automatically find trailing commas in your javascript project","slug":"2012-08-05-automatically-find-trailing-commas-in","date":"2012-08-05T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2012/08/05/2012-08-05-automatically-find-trailing-commas-in/","link":"","permalink":"http://ericsimmerman.com/2012/08/05/2012-08-05-automatically-find-trailing-commas-in/","excerpt":"","text":"These are simply updated instructions based upon the original Amaxus writeup here.Install Rhino &nbsp;(I used \"port install rhino\")Grab the Rhinoized JSLint script here.Create a script named checkForJsErrors.sh with the following two lines:echo $1rhino&nbsp;rhinoed_jslint.js $1 | fgrep -e 'Unexpected' --color=always&nbsp;Create an alias in your bashrcalias checkjs='find . -name '''*.js''' -exec ~/bin/checkForJsErrors.sh {} ;'Now when you execuate that alias in your project's root directory - all of your .js files will be scanned for trailing commas.You're welcome.&nbsp;","categories":[],"tags":[]},{"title":"orphanRemoval issues in Play Framework 'collection owner not associated with session'","slug":"2012-08-03-orphanremoval-issues-in-play-framework","date":"2012-08-03T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2012/08/03/2012-08-03-orphanremoval-issues-in-play-framework/","link":"","permalink":"http://ericsimmerman.com/2012/08/03/2012-08-03-orphanremoval-issues-in-play-framework/","excerpt":"","text":"I was just burned by an issue in Play Framework's JPA support of orphanRemovals. The issue manifests as a \"collection owner not associated with session\" JPAException within Play Framework 1.2.x &nbsp;- it was supposed to be addressed in 1.2.5 with this patch, but I'm running 1.2.5 and am still running into it.I didn't take the time to diagnose or file a report - for now I'm punting by restricting the use of 'orphanRemoval'.","categories":[],"tags":[]},{"title":"Cautionary tale regarding cloud security","slug":"2012-07-25-cautionary-tale-regarding-cloud-security","date":"2012-07-25T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2012/07/25/2012-07-25-cautionary-tale-regarding-cloud-security/","link":"","permalink":"http://ericsimmerman.com/2012/07/25/2012-07-25-cautionary-tale-regarding-cloud-security/","excerpt":"","text":"My work with FolderGrid has included quite a few very interesting technical problems that have resulted in material for this blog.&nbsp;I just&nbsp;posted an interesting read for anyone using cloud services&nbsp;to store or transport sensitive data.&nbsp;","categories":[],"tags":[]},{"title":"Compiling Maven project with JNLP API 1.6+ on Mac OS X","slug":"2012-07-11-compiling-maven-project-with-jnlp-api","date":"2012-07-11T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2012/07/11/2012-07-11-compiling-maven-project-with-jnlp-api/","link":"","permalink":"http://ericsimmerman.com/2012/07/11/2012-07-11-compiling-maven-project-with-jnlp-api/","excerpt":"","text":"To compile a project using JNLP API with Maven you'll need javaws.jar in the compile-time classpath. You'll find the jar under the lib folder of your JDK installation. Mine was here:/System/Library/Java/JavaVirtualMachines/1.6.0.jdk/Contents/Home/lib/javaws.jar&nbsp;","categories":[],"tags":[]},{"title":"Resolving Spring Security ACL deadlock in MySQL","slug":"2012-06-30-resolving-spring-security-acl-deadlock","date":"2012-06-30T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2012/06/30/2012-06-30-resolving-spring-security-acl-deadlock/","link":"","permalink":"http://ericsimmerman.com/2012/06/30/2012-06-30-resolving-spring-security-acl-deadlock/","excerpt":"","text":"The default JDBCTemplate based implementation of Spring Security ACLs removes and recreates the entire ACL for each update. That requires both deletes and inserts into the same table within the same JPA transaction and is a recipe for deadlock when using the default MySQL transaction isolation level of REPEATABLE_READ.&nbsp;Setting your transaction isolation level to READ_COMMITTED is a viable alternative to MySQL's default but be certain you are not using the default bin-log format of Statement as this is not compatible with READ_COMMITTED isolation. You'll need to use Mixed or Row level bin-log format instead.&nbsp;","categories":[],"tags":[]},{"title":"Great explanation of the 'The Infamous Loop Problem' in javascript","slug":"2012-05-21-great-explanation-of-infamous-loop","date":"2012-05-21T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2012/05/21/2012-05-21-great-explanation-of-infamous-loop/","link":"","permalink":"http://ericsimmerman.com/2012/05/21/2012-05-21-great-explanation-of-infamous-loop/","excerpt":"","text":"Thanks Robert Nyman for your apparently timeless explanation of the Infamous Loop Problem&nbsp;that caught me when declaring my callbacks to an asynchronous request tonight.","categories":[],"tags":[]},{"title":"By popular demand ... my git-aware bash prompt","slug":"2012-02-16-by-popular-demand-my-git-aware-bash","date":"2012-02-16T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2012/02/16/2012-02-16-by-popular-demand-my-git-aware-bash/","link":"","permalink":"http://ericsimmerman.com/2012/02/16/2012-02-16-by-popular-demand-my-git-aware-bash/","excerpt":"","text":"Pirated from a long forgotten place...apologies to the respective copyright holders. Just paste this in your .bashrc for git-aware goodness:Loading ....","categories":[],"tags":[]},{"title":"Configure my Amazon EC2 instances to only accept traffic from the Elastic Load Balancer","slug":"2012-01-24-configure-my-amazon-ec2-instances-to","date":"2012-01-24T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2012/01/24/2012-01-24-configure-my-amazon-ec2-instances-to/","link":"","permalink":"http://ericsimmerman.com/2012/01/24/2012-01-24-configure-my-amazon-ec2-instances-to/","excerpt":"","text":"The AWS&nbsp;Elastic Load Balancing FAQ has this very relevant question:Can I configure my Amazon EC2 instances to only accept traffic from the Elastic Load Balancer?followed by an ever so helpful response:Yes.Seriously - no links, no reference to documentation, nothing. With such a tremendous investment in infrastructure you'd think Amazon might spend a day or two on documentation...alas.Insult to injury it's also not at all obvious what you need to do to configure your Security Group to support this very commonly desired configuration. I'm here to help.Use the not-so-documented 'amazon-elb/amazon-elb-sg' Security Group name as the Inbound Source for your Security Group rule to filter on traffic coming from your AWS ELB. Enjoy!","categories":[],"tags":[]},{"title":"Resolving git-gc error on Mac","slug":"2012-01-19-resolving-git-gc-error-on-mac","date":"2012-01-19T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2012/01/19/2012-01-19-resolving-git-gc-error-on-mac/","link":"","permalink":"http://ericsimmerman.com/2012/01/19/2012-01-19-resolving-git-gc-error-on-mac/","excerpt":"","text":"During today's maintenance run of git-gc on our Mac hosted repo I encountered screenfulls of nasty fatal error messages - but the last two were a clue to the root cause:fatal: Unable to create temporary file: Too many open fileserror: failed to run repackThis related post helped me find a quick cure which involved simply bumping the ulimit up temporarily.# ulimit -n 10024&gt; git gcEasy fix for a potentially bad day.","categories":[],"tags":[]},{"title":"Play framework on AWS","slug":"2012-01-08-play-framework-on-aws","date":"2012-01-08T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2012/01/08/2012-01-08-play-framework-on-aws/","link":"","permalink":"http://ericsimmerman.com/2012/01/08/2012-01-08-play-framework-on-aws/","excerpt":"","text":"Steps I took to get a Play framework app up and running on a micro AWS instance running Ubuntu 11.10sudo add-apt-repository \"deb http://archive.canonical.com/ lucid partner\"sudo apt-get updatesudo apt-get install sun-java6-jdk unzipwget http://download.playframework.org/releases/play-1.2.4.zipsudo unzip play-1.2.4.zip -d /usr/local/share/install&nbsp;Dominik Dorn's startup scriptwget https://raw.github.com/gist/1290012/a31b1d079705ea7ccf6d1fdc866027b674e62841/...sudo mv playframework /etc/init/update the script with proper paths&nbsp;useradd username -g www-data -m -d /home/username&nbsp;-s /bin/bashinstall your appinitctl start playframework","categories":[],"tags":[]},{"title":"Install APC on CentOS 5.6","slug":"2012-01-05-install-apc-on-centos-56","date":"2012-01-05T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2012/01/05/2012-01-05-install-apc-on-centos-56/","link":"","permalink":"http://ericsimmerman.com/2012/01/05/2012-01-05-install-apc-on-centos-56/","excerpt":"","text":"The following resolved a few gotchas I encountered installing APC on an old instance of CentOS 5.6mount -o remount,exec /tmpyum install pcre-develpecl install apcmount -o remount,noexec /tmp","categories":[],"tags":[]},{"title":"Loading Fixtures for FunctionalTest in Play Framework","slug":"2011-12-11-loading-fixtures-for-functionaltest-in","date":"2011-12-11T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/12/11/2011-12-11-loading-fixtures-for-functionaltest-in/","link":"","permalink":"http://ericsimmerman.com/2011/12/11/2011-12-11-loading-fixtures-for-functionaltest-in/","excerpt":"","text":"There are three possible gotchas with FunctionalTest on Play Framework 1.2.4:Ensure your db is configured for READ_UNCOMMITED transactions. See the release notes for more...Make certain that you import junit's @Before and **NOT** play.mvc.BeforeLoad your Fixtures in a Job. See the example below.&nbsp; Loading ....","categories":[],"tags":[]},{"title":"GAE price increases lead to a hard learned lesson regarding platform lockin","slug":"2011-11-14-gae-price-increases-lead-to-hard","date":"2011-11-14T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/11/14/2011-11-14-gae-price-increases-lead-to-hard/","link":"","permalink":"http://ericsimmerman.com/2011/11/14/2011-11-14-gae-price-increases-lead-to-hard/","excerpt":"","text":"Google's pricing changes for GAE&nbsp;have increased the cost of my two very small applications tenfold. &nbsp;I'm not alone. As a result, I've dropped them to the free tier on GAE - making them practically useless.&nbsp;So long GAE, I hardly knew thee...","categories":[],"tags":[]},{"title":"Secure file storage in the 'cloud'","slug":"2011-11-05-secure-file-storage-in-the","date":"2011-11-05T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/11/05/2011-11-05-secure-file-storage-in-the/","link":"","permalink":"http://ericsimmerman.com/2011/11/05/2011-11-05-secure-file-storage-in-the/","excerpt":"","text":"In my quest for the perfect sync for the relatively small set of sensitive files I want available from all my workstations I've tried several cloud based services: Dropbox, JungleDisk,&nbsp;Wuala, and Egnyte just to name a few.Dropbox and JungleDisk both require custom-rolled workarounds (like using a TrueCrypt volume) to keep sensitive files secured. Egnyt encrypts your data at rest but they use a common key which means you are reliant upon their business practices for data security. Wuala encrypts your data with a private key before transmitting it, but their client is quite cumbersome. I've found&nbsp;SpiderOak to be the best fit for my needs.Native Mac client that starts automatically and runs quietly in the trayZero-knowledge encryption of all my filesSupports a smart folder sync&nbsp;Free entry-level account with 2G of space&nbsp;","categories":[],"tags":[]},{"title":"Mac 10.6.5 Snow Leopard Server LDAP Bug","slug":"2011-10-17-mac-1065-snow-leopard-server-ldap-bug","date":"2011-10-17T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/10/17/2011-10-17-mac-1065-snow-leopard-server-ldap-bug/","link":"","permalink":"http://ericsimmerman.com/2011/10/17/2011-10-17-mac-1065-snow-leopard-server-ldap-bug/","excerpt":"","text":"via gcsdblogs.org Many thanks to Roodhouse Tech Blog for pointing me in the right direction regarding an issue with Open Directory on my Mac Server after a certificate update.","categories":[],"tags":[]},{"title":"Listening to Sense.fm while they fix their domain registry","slug":"2011-10-05-listening-to-sensefm-while-they-fix","date":"2011-10-05T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/10/05/2011-10-05-listening-to-sensefm-while-they-fix/","link":"","permalink":"http://ericsimmerman.com/2011/10/05/2011-10-05-listening-to-sensefm-while-they-fix/","excerpt":"","text":"Sense.fm's domain registration expired Sept. 16th - oops. That makes their website and streams inaccessible through normal means until they are able to resolve the registry issues.The good news is that they are continuing to broadcast so if you simply bypass the DNS network you can get around the issue and get your Sense.fm fix.The easiest way to work around the issue is to add an entry to your hosts file. A quick dig of their nameservers (ns1.webpartnersworldwide.com) shows us the IP address we need is&nbsp;174.121.134.99.So we want to add the following to our hosts file:174.121.134.99 sense.fm www.sense.fmOn sane systems like my Mac the hosts file is /etc/hosts but on Windows it's usually&nbsp;c:windowssystem32driversetchostsAfter you add the sense.fm line to your hosts file just open your browser and visit www.sense.fm&nbsp;like normal.You're welcome!&nbsp;&nbsp;","categories":[],"tags":[]},{"title":"SLF4JLocationAwareLog serialization exception","slug":"2011-09-22-slf4jlocationawarelog-serialization","date":"2011-09-22T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/09/22/2011-09-22-slf4jlocationawarelog-serialization/","link":"","permalink":"http://ericsimmerman.com/2011/09/22/2011-09-22-slf4jlocationawarelog-serialization/","excerpt":"","text":"While attempting to make a large object graph serializable I kept encountering NotSerializableExceptions regarding my Log references which were instances of&nbsp;SLF4JLocationAwareLog. The references were declared transient so I beat my head on a wall for a few hours before upgrading my slf4j version from 1.4.2 to 1.5.8Somewhat frustratingly - that resolved the issue. No idea why.","categories":[],"tags":[]},{"title":"Upgrading a Snow Leopard development machine to Lion","slug":"2011-09-22-upgrading-snow-leopard-development","date":"2011-09-22T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/09/22/2011-09-22-upgrading-snow-leopard-development/","link":"","permalink":"http://ericsimmerman.com/2011/09/22/2011-09-22-upgrading-snow-leopard-development/","excerpt":"","text":"1. Install LionIf you heard about the small business 20-pack of licences Apple offered when they announced Lion and think you might want to go that route - don't. &nbsp;Trust me. &nbsp;They can take your payment but they just can't fulfill your order ... and that's really the most important part. Two months later I have a micro USB drive and am finally starting the upgrades.2. Use App Store to download &amp; install XCodeAnnoying. At least they fixed the download process to support resumes. Mine cutoff at 98% of the 4G download but picked back up where it left off on resume.3. Run &nbsp;\"/Applications/Install Xcode.app\"So when App Store said it was \"Installing Xcode\" it meant it was installing the Xcode installer. Sadly, it took me a while to figure this one out ... and I am not alone.4. Install MacPorts 2.0.3 or greaterMacPorts install for Lion worked the first time with no hassle - Apple could learn a thing or two.5. Run \"port upgrade outdated\"This takes some time but ran without error for me...nice.6. Update php.iniLion upgrades to PHP 2.3.0 and saves but disables your existing php.ini - at a minimum you'll need to update your mysql socket entries to point to the same place as your my.cnf&nbsp;7. Install a JDKI attempted to run a Java driven app (LibreOffice) and Lion magically prompted me to install Java. I let it and the install process flawlessly&nbsp;setup a full JDK instead of just a JRE&nbsp;- nice job Apple.8. Toggle trackpad scroll directionIf all my devices used Lion I'm certain I'd adapt to the inverted scrolling in just a few hours - but they don't and that causes wheel spinning everytime I begin a Lion based session. &nbsp;I see no net benefit so it's not worth the pain. &nbsp;System Preferences -&gt; Trackpad -&gt; Scroll direction -&gt; unchceck9. Install the updated Server toolsIf you run a Mac Server and want to use your Lion workstation to manage its services...you need the updated Mac Server Tools.10. Disable DashboardI don't care for widgets.defaults write com.apple.dashboard mcx-disabled -boolean YESkillall Dock11. Install JDK sourceGrab the Java for Mac OS X 10.7 Developer Package from&nbsp;http://connect.apple.com/It'll put the src.jar here/Library/Java/JavaVirtualMachines/1.6.0_26-b03-383.jdk/Contents/Home/src.jar","categories":[],"tags":[]},{"title":"Winner takes all network effect","slug":"2011-09-13-winner-takes-all-network-effect","date":"2011-09-13T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/09/13/2011-09-13-winner-takes-all-network-effect/","link":"","permalink":"http://ericsimmerman.com/2011/09/13/2011-09-13-winner-takes-all-network-effect/","excerpt":"","text":"Read this -&nbsp;http://edge.org/conversation/the-local-global-flip","categories":[],"tags":[]},{"title":"Resolving 'Can't connect to window server - not enough permissions' forMaven test runs","slug":"2011-08-26-resolving-connect-to-window-server-not","date":"2011-08-26T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/08/26/2011-08-26-resolving-connect-to-window-server-not/","link":"","permalink":"http://ericsimmerman.com/2011/08/26/2011-08-26-resolving-connect-to-window-server-not/","excerpt":"","text":"Our CI server (we use Jenkins) recently began bombing on several new tests that referenced java.awt packaged classes. The most common error in the stacktrace was \"NoClassDefFoundError: Could not initialize class java.awt.Color\" and diving deeper we could see the root cause was \"Can't connect to window server - not enough permissions\".The interwebs all claimed setting -Djava.awt.headless=true would resolve the issue but it did nothing for us. We set it as a Jenkins system parameter, in the launchctl job, in the bash_profile of the Jenkins user on the machine, and everywhere we could in the Jenkins job itself....to no avail.Just before heading down the path of setting it programatically somewhere in our test stack - I noticed that our&nbsp;maven-surefire-plugin was configured to use a threadCount of 10. On a hunch that&nbsp;maven-surefire-plugin was not exporting my system properties to the new threads it spawned for the test run - I configured the plugin to set java.awt.headless with the following snip from our pom.xml&lt;plugin&gt; &nbsp;&lt;groupId&gt;org.apache.maven.plugins&lt;/groupId&gt; &nbsp;&lt;artifactId&gt;maven-surefire-plugin&lt;/artifactId&gt; &nbsp;&lt;version&gt;2.5&lt;/version&gt; &nbsp;&lt;configuration&gt; &nbsp;&lt;excludes&gt; &nbsp;&lt;exclude&gt;**/TestInstanceBakerTest.java&lt;/exclude&gt; &nbsp;&lt;exclude&gt;**/ExpectedAnswerGeneratorTest.java&lt;/exclude&gt; &nbsp;&lt;exclude&gt;**/ClientNukeTest.java&lt;/exclude&gt; &nbsp;&lt;exclude&gt;**/TestInstanceBank.java&lt;/exclude&gt; &nbsp;&lt;/excludes&gt; &nbsp;&lt;parallel&gt;true&lt;/parallel&gt; &nbsp;&lt;threadCount&gt;10&lt;/threadCount&gt; &nbsp;&lt;systemPropertyVariables&gt; &nbsp;&lt;java.awt.headless&gt;true&lt;/java.awt.headless&gt; &nbsp;&lt;log4j.configuration&gt;${runtime.log4j.config}&lt;/log4j.configuration&gt; &nbsp;&lt;/systemPropertyVariables&gt; &nbsp;&lt;/configuration&gt;&lt;/plugin&gt;Problem solved.","categories":[],"tags":[]},{"title":"Resolving 'Connection.close() has already been called.' when running long db-migration","slug":"2011-08-23-resolving-has-already-been-called-when","date":"2011-08-23T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/08/23/2011-08-23-resolving-has-already-been-called-when/","link":"","permalink":"http://ericsimmerman.com/2011/08/23/2011-08-23-resolving-has-already-been-called-when/","excerpt":"","text":"I tune my datasource appropriate for runtime but also use the same datasource for db-migration activities on application startup. For some particularly long db-migration runs - I began encountering a \"Connection.close() has already been called.\" error. &nbsp;The easy workaround was to bump the value of MySQL's wait_timeout parameter.Don't for get to restart MySQL afterwards.Also - if you're using a dbcp datasource try setting&nbsp;testOnBorrow to true if you have it explicitly set to false.You're welcome.","categories":[],"tags":[]},{"title":"JSP tricks to make templating easier on Stack Overflow","slug":"2011-08-19-jsp-tricks-to-make-templating-easier-on","date":"2011-08-19T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/08/19/2011-08-19-jsp-tricks-to-make-templating-easier-on/","link":"","permalink":"http://ericsimmerman.com/2011/08/19/2011-08-19-jsp-tricks-to-make-templating-easier-on/","excerpt":"","text":"The beauty of JSP Tag files is that it lets you basically tag generic markup and then refactor it to your hearts content.JSP Tag Files have pretty much usurped things like Tiles etc., at least for me. I find them much easier to use as the only structure is what you give it, nothing preconceived. Plus you can use JSP tag files for other things (like the user detail fragment above).via stackoverflow.comWill Hartung's overview of JSP 2.0's Tag Files is a great primer","categories":[],"tags":[]},{"title":"Testing a local web application with multiple operatings systems using VirtualBox","slug":"2011-08-17-testing-local-web-application-with","date":"2011-08-17T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/08/17/2011-08-17-testing-local-web-application-with/","link":"","permalink":"http://ericsimmerman.com/2011/08/17/2011-08-17-testing-local-web-application-with/","excerpt":"","text":"I develop on Mac OS X and frequently need to test my local build using Internet Explorer on a flavor of MS Windows. VirtualBox has supported an easy method of doing so since version 2.2&nbsp;Add a new Network Adapter to each of your VirtualBox Guests (I run Windows XP and Windows 7 as Guests) and choose \"Host-only Adapter\" for the \"Attached to:\" option. This will result in the creation of a new loopback interface on your Host and a private network interface on each Guest.On Windows use the command line \"ipconfig\" to determine the new interface settings. On Mac run \"ifconfig\" to do the same. &nbsp;With my setup the host (my mac) was assigned the vboxnet0 interface with private IP address&nbsp;192.168.56.1 so&nbsp;I punched a hole in my host's firewall to allow each Guest to access ports 80,443,8080,8443 on that subnet. Now I can simply open a browser on any guest and access the webserver running my local build on my host like - https://192.168.56.1:8443/&nbsp;","categories":[],"tags":[]},{"title":"MacPorts: MySQL upgrade from 5.0.x to 5.1.x error Column count of mysql.proc is wrong","slug":"2011-08-06-macports-mysql-upgrade-from-50x-to-51x","date":"2011-08-06T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/08/06/2011-08-06-macports-mysql-upgrade-from-50x-to-51x/","link":"","permalink":"http://ericsimmerman.com/2011/08/06/2011-08-06-macports-mysql-upgrade-from-50x-to-51x/","excerpt":"","text":"sudo&nbsp; /opt/local/lib/mysql5/bin/mysql_upgrade -uroot -p &ndash;basedir=/opt/local/lib/mysql5/bin/mysqlvia kurund.comCommand above resolved my \"Column count of mysql.proc is wrong\" error after a macports upgrade to 5.1.x","categories":[],"tags":[]},{"title":"Publish OpenLaszlo swf using swfobject2 for better progress indicator with IE","slug":"2011-07-30-publish-openlaszlo-swf-using-swfobject2","date":"2011-07-30T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/07/30/2011-07-30-publish-openlaszlo-swf-using-swfobject2/","link":"","permalink":"http://ericsimmerman.com/2011/07/30/2011-07-30-publish-openlaszlo-swf-using-swfobject2/","excerpt":"","text":"Default \"Loading...\" progress indicator for OpenLaszlo swfs leaves much to be desired in IE and the embed scripts that come bundled with OpenLaszlo are kludgy when compared with a SWFObject2 solution. Here's how I publish OpenLaszlo apps using SWFObject2. This technique includes a x-platform compatible javascript driven percentage loaded indicator.Note that this solution does not currently support calls to lz.BrowserService.callJS() &lt;script type=\"text/javascript\" src=\"http://ajax.googleapis.com/ajax/libs/swfobject/2.2/swfobject.js\"&gt;&lt;/script&gt;&lt;script type=\"text/javascript\" src=\"http://ajax.googleapis.com/ajax/libs/jquery/1.3.2/jquery.min.js\"&gt;&lt;/script&gt;&lt;script type=\"text/javascript\"&gt;function callbackFn() {&nbsp;&nbsp;&nbsp; try{&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; swfobject.addDomLoadEvent(pageloaded);&nbsp;&nbsp;&nbsp; }catch(error){&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; setTimeout(\"swfloaded()\",1500);&nbsp;&nbsp;&nbsp; }&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; }function pageloaded() {&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; try{&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; var percentLoaded = swfobject.getObjectById(\"ObjId\").PercentLoaded();&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; $('#lzsplashtext').html(\"Percent Loaded: \"+percentLoaded+\"% ...\");&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; if(percentLoaded &lt; 100){&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; setTimeout(\"pageloaded()\",150);&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; }else{&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; swfloaded();&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; }&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; }catch(error){&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; setTimeout(\"swfloaded()\",1500);&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; }&nbsp;&nbsp;&nbsp; }function swfloaded() {&nbsp;&nbsp;&nbsp; $('#lzsplash').hide();&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; }&nbsp;&nbsp;&nbsp; swfobject.registerObject(\"ObjId\", \"10.3.0\", \"/expressInstall.swf\",callbackFn);&lt;/script&gt;...&lt;div id=\"lzsplash\" style=\"z-index: 10000000; top: 0; left: 0; width: 100%; height: 100%; position: fixed; display: table\"&gt;&lt;p style=\"display: table-cell; vertical-align: middle; align: center;\"&gt;&lt;div id=\"lzsplashtext\" style=\"display: block; margin: 20% auto; font-size:24px; font-family:Helvetica,sans-serif;\" align=\"center\"&gt;Loading, please wait...&lt;/div&gt;&lt;/p&gt;&lt;/div&gt;&nbsp;&nbsp;&nbsp; &lt;div style=\"height:100%;\"&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;!--&lt;![endif]--&gt;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &lt;/object&gt;&nbsp;&nbsp;&nbsp; &lt;/div&gt;","categories":[],"tags":[]},{"title":"MindTouch SSO using HttpClient 4.1 with Java","slug":"2011-07-05-mindtouch-sso-using-httpclient-41-with","date":"2011-07-05T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/07/05/2011-07-05-mindtouch-sso-using-httpclient-41-with/","link":"","permalink":"http://ericsimmerman.com/2011/07/05/2011-07-05-mindtouch-sso-using-httpclient-41-with/","excerpt":"","text":"Most of the MindTouch sample code available in the wild is in PHP or C# so integrating with a Java stack can be painful. Here's a snip of the code we used to support SSO with our Java-based SaaS platform. The HttpClient framework is version 4.1 of Apache's HttpClientUpdate: Modified to skip Cookie parsing based upon bjorg's commentprivate boolean parseAndSetMindtouchCookie(final HttpServletResponse response,final DefaultHttpClient client,final User user) {&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; StringBuffer buf = new StringBuffer(\"http://\");&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; buf.append(this.MINDTOUCH_HOST).append(this.MINDTOUCH_BASEURI).append(\"users/authenticate?authprovider=1&amp;apikey=\").append(MINDTOUCH_APIKEY);&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; HttpGet get = new HttpGet(buf.toString());&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; try {&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ResponseHandler&lt;String&gt; responseHandler = new BasicResponseHandler();&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; String responseBody = client.execute(get, responseHandler);&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; javax.servlet.http.Cookie cookie = new javax.servlet.http.Cookie(\"authtoken\", responseBody);&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; cookie.setDomain(\".example.com\");&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; cookie.setSecure(false);&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; cookie.setPath(\"/\");&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; cookie.setMaxAge(3600); // 1 hour&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; response.addCookie(cookie);&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; log.debug(\"Successfully set mindtouch auth cookie\");&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; response.sendRedirect(\"http://\"+MINDTOUCH_HOST);&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; return true;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; }catch(HttpResponseException hre){&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; if(hre.getStatusCode() == HttpStatus.SC_UNAUTHORIZED ){&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; log.debug(\"User has no Mindtouch account.\");&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; }else{&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; log.error(\"Unable to auth user.\",hre);&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; }&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; } catch (Exception e) {&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; log.error(\"Unable to authenticate user\",e);&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; }&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; return false;&nbsp;&nbsp;&nbsp; }","categories":[],"tags":[{"name":"java","slug":"java","permalink":"http://ericsimmerman.com/tags/java/"},{"name":"httpclient","slug":"httpclient","permalink":"http://ericsimmerman.com/tags/httpclient/"},{"name":"mindtouch","slug":"mindtouch","permalink":"http://ericsimmerman.com/tags/mindtouch/"}]},{"title":"Running Tomcat on Ubuntu 10.04.2 Server","slug":"2011-05-06-running-tomcat-on-ubuntu-10042-server","date":"2011-05-06T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/05/06/2011-05-06-running-tomcat-on-ubuntu-10042-server/","link":"","permalink":"http://ericsimmerman.com/2011/05/06/2011-05-06-running-tomcat-on-ubuntu-10042-server/","excerpt":"","text":"1. Install Oracle's JDK using the following commands:sudo apt-get install python-software-propertiessudo add-apt-repository ppa:sun-java-community-team/sun-java6sudo apt-get updatesudo apt-get install sun-java6-jdk2. Install APR:wget http://www.ecoficial.com/apachemirror//apr/apr-1.4.2.tar.gztar -xzf apr-1.4.2.tar.gzrm apr-1.4.2.tar.gzcd apr-1.4.2/sudo apt-get install makesudo ./configuresudo makesudo make install3. apt-get install libssl-dev4. Configure and Install the jni/native package that comes with your Tomcat tarball&nbsp;","categories":[],"tags":[]},{"title":"Stopping a TCP Split Handshake Spoof Attack with SonicWALL","slug":"2011-04-13-stopping-tcp-split-handshake-spoof","date":"2011-04-13T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/04/13/2011-04-13-stopping-tcp-split-handshake-spoof/","link":"","permalink":"http://ericsimmerman.com/2011/04/13/2011-04-13-stopping-tcp-split-handshake-spoof/","excerpt":"","text":"via youtube.com I prefer \"howto\" articles to videos but this was the first source I found demonstrating how to harden my SonicWall against the TCP/IP Handshake hole making the rounds this week. Skip to 35 seconds in for the useful stuff...","categories":[],"tags":[]},{"title":"Resolving Firefox 4 issues on Mac OS X Snow Leopard","slug":"2011-04-11-resolving-firefox-4-issues-on-mac-os-x","date":"2011-04-11T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/04/11/2011-04-11-resolving-firefox-4-issues-on-mac-os-x/","link":"","permalink":"http://ericsimmerman.com/2011/04/11/2011-04-11-resolving-firefox-4-issues-on-mac-os-x/","excerpt":"","text":"I encountered all types of strange behavior using Firefox 4 after my recent upgrade. The nastiest bug prevented me from accessing any windows other than the primary Firefox window. So all popups, while listed on the Windows menu, were completely inaccessible. I tried all the typical workarounds like disabling Addons and running in Safemode. But nothing permanently fixed the issue. Finally - I simply created a new Firefox profile and transferred the bookmarks, passwords, etc... that I wanted to carryover. This resolved my issues completely. So before you throw away FF4 in frustration - try creating a clean profile. Probably not a bad idea anyway - I noticed FF3.0 cruft in my profile that I shed as part of this process.","categories":[],"tags":[]},{"title":"Enhanced mysqldump to support data cleansing compliance requirements by nullifying specific fields","slug":"2011-04-08-enhanced-mysqldump-to-support-data","date":"2011-04-08T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/04/08/2011-04-08-enhanced-mysqldump-to-support-data/","link":"","permalink":"http://ericsimmerman.com/2011/04/08/2011-04-08-enhanced-mysqldump-to-support-data/","excerpt":"","text":"At Pascal Metrics, my team collects large sets of data including ePHI. That subjects us to HIPAA and federal law dictates how we handle said data. Before I can even consider moving a database export out of our hardened production environment, I need to cleanse the export of any personally identifying information - including but not limited to any ePHI.There are number of ways to achieve that aim, but once our database crossed the threshold into \"large\" territory - cleansing the data became a real chore. I decided to roll my own mysqldump binary and add a parameter called \"nullify-field\" which is based upon the \"ignore-table\" parameter from the official release.I've posted my modified source to my GitHub account for any who may be interested.You'll have to compile your own copy - but that's relatively easy:Grab the latest mysql 5.0.X source&nbsp;Copy my 2 modified source files over the ones that come with your source tarballRun \"./configure --without-server\" to build just the mysql clientsRun \"make\" to generate your custom mysqldump under ./client/Example Usage: ./client/mysqldump -u backupuser -p --nullify-field=my_db.my_sensitive_table.name --nullify-field=my_db.my_sensitive_table.email my_db I love open source software.","categories":[],"tags":[]},{"title":"Minimizing expense when testing webapps on Internet Explorer","slug":"2011-04-06-minimizing-expense-when-testing-webapps","date":"2011-04-06T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/04/06/2011-04-06-minimizing-expense-when-testing-webapps/","link":"","permalink":"http://ericsimmerman.com/2011/04/06/2011-04-06-minimizing-expense-when-testing-webapps/","excerpt":"","text":"Currently - my favorite methods of testing web applications for Internet Explorer compatibility at minimal expenditure of time, money, and pain are: Virtualbox installations PROS: Great performance and virtually zero hassle after initial setup CONS: These are not easily shared, so every developer needs his own virtual machine which needs to be individually licensed GoGrid on-demand servers PROS: Instances can be shared by multiple developers so you only need to configure each virtual machine environment once. MS Windows Licensing is built into the on-demand pricing. CONS: Performance is adequate, but screen refreshes are slow enough to be distracting. It takes about 15 minutes to spin an instance up. With either method of obtaining a virtual machine, you'll have to decide how to handle testing for all the permutations you need to support. The \"brute force\" method is to create a virtual machine for each permutation of OS, Browser, Flash Player, etc...&nbsp; There are some other options though: Microsoft Expression Web SuperPreview for Windows Internet Explorer&nbsp; can be used to test basic IE6 support on a machine with a more recent version installed - but not a terribly accurate emulator Internet Explorer 8 with Developer Tools installed using \"Compatibility\" mode to emulate IE7 works well enough to debug javascript","categories":[],"tags":[]},{"title":"Solution for Firefox 4 installation failure on Mac OS X due to 'libsmime3.dylib is in use' error","slug":"2011-03-28-solution-for-firefox-4-installation","date":"2011-03-28T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/03/28/2011-03-28-solution-for-firefox-4-installation/","link":"","permalink":"http://ericsimmerman.com/2011/03/28/2011-03-28-solution-for-firefox-4-installation/","excerpt":"","text":"If you're attempting to upgrade to Firefox 4 on Mac and encounter this beauty then you'll need to perform the following terminal commands as an easy workaround. cd /Library/LaunchDaemons/ sudo launchctl stop com.cisco.anyconnect.vpnagentd sudo launchctl unload com.cisco.anyconnect.vpnagentd.plist killall vpnagentdNow attempt to install FireFox 4 again before issuing the following to reconfigure VPNAgent: launchctl load com.cisco.anyconnect.vpnagentd.plistI've seen some other posts online suggesting that the killall command is sufficient, but that didn't work for me because vpnagentd was setup to automatically restart. The process I outlined here prevents that.","categories":[],"tags":[]},{"title":"Installing gerrit2 on Mac OS X Server (Snow Leopard)","slug":"2011-03-25-installing-gerrit2-on-mac-os-x-server","date":"2011-03-25T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/03/25/2011-03-25-installing-gerrit2-on-mac-os-x-server/","link":"","permalink":"http://ericsimmerman.com/2011/03/25/2011-03-25-installing-gerrit2-on-mac-os-x-server/","excerpt":"","text":"I'm using the default runtime container of gerrit (Jetty) configured for SSL proxy behind the Mac Server apache2 instance. I've configured direct LDAP integration and am using the Mac Server mysql instance.Here's what the init parameters look like:&nbsp;java -jar gerrit.war init -d review_site*** Gerrit Code Review 2.1.6.1***&nbsp;&nbsp;*** Git Repositories***&nbsp;Location of Git repositories &nbsp; [/Library/Git/repositories/]:&nbsp;Import existing repositories &nbsp; [Y/n]?&nbsp;*** SQL Database***&nbsp;Database server type &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; [MYSQL/?]:&nbsp;Server hostname &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;[localhost]:&nbsp;Server port &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;[(MYSQL default)]:&nbsp;Database name &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;[reviewdb]:&nbsp;Database username &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;[gerrit2]:&nbsp;Change gerrit2's password &nbsp; &nbsp; &nbsp;[y/N]?&nbsp;*** User Authentication***&nbsp;Authentication method &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;[LDAP/?]:&nbsp;LDAP server &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;[ldaps://my.server.fqdn]:&nbsp;LDAP username &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;[]:&nbsp;anonymous's password &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; :&nbsp;&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;confirm password :&nbsp;Account BaseDN &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; [cn=users,dc=hostname,dc=pascalmetrics,dc=com]:&nbsp;Group BaseDN &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; [cn=groups,dc=hostname,dc=pascalmetrics,dc=com]:&nbsp;*** Email Delivery***&nbsp;SMTP server hostname &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; [localhost]:&nbsp;SMTP server port &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; [(default)]:&nbsp;SMTP encryption &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;[NONE/?]:&nbsp;SMTP username &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;:&nbsp;*** Container Process***&nbsp;Run as &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; [gerrituser]:&nbsp;Java runtime &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; [/System/Library/Java/JavaVirtualMachines/1.6.0.jdk/Contents/Home]:&nbsp;&nbsp;Upgrade /opt/gerrit-2.1.6.1/review_site/bin/gerrit.war [Y/n]?&nbsp;Copying gerrit.war to /opt/gerrit-2.1.6.1/review_site/bin/gerrit.war&nbsp;*** SSH Daemon***&nbsp;&nbsp;Listen on address &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;[*]:&nbsp;Listen on port &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; [29418]:&nbsp;&nbsp;*** HTTP Daemon***&nbsp;&nbsp;Behind reverse proxy &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; [Y/n]?&nbsp;Proxy uses SSL (https://) &nbsp; &nbsp; &nbsp;[Y/n]?&nbsp;Subdirectory on proxy server &nbsp; [/gerrit]:&nbsp;Listen on address &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;[*]:&nbsp;Listen on port &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; [9028]:&nbsp;&nbsp;Scanning /Library/Git/repositories&nbsp;&nbsp;I had to tweak one my.cnf setting to allow gerrit to complete my initial install. I needed to set log_bin_trust_function_creators=1&nbsp;&nbsp;","categories":[],"tags":[]},{"title":"Tax Article: Stock Options and Restricted Stock - MBBP.com","slug":"2011-03-11-tax-article-stock-options-and","date":"2011-03-11T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/03/11/2011-03-11-tax-article-stock-options-and/","link":"","permalink":"http://ericsimmerman.com/2011/03/11/2011-03-11-tax-article-stock-options-and/","excerpt":"","text":"Great article on treatment of ISOs vs Restricted Stock complete with 83(b) considerationvia mbbp.com","categories":[],"tags":[{"name":"iso83bstockoptions","slug":"iso83bstockoptions","permalink":"http://ericsimmerman.com/tags/iso83bstockoptions/"}]},{"title":"Why you might want to exercise your vested ISOs this year...","slug":"2011-03-11-why-you-might-want-to-exercise-your","date":"2011-03-11T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/03/11/2011-03-11-why-you-might-want-to-exercise-your/","link":"","permalink":"http://ericsimmerman.com/2011/03/11/2011-03-11-why-you-might-want-to-exercise-your/","excerpt":"","text":"The Small Business Jobs Act of 2010 (the \"Jobs Act\"), which was enacted September 27, 2010, contains a brief window of opportunity for non-corporate taxpayers to purchase Qualified Small Business (\"QSB\") stock (also known as \"section 1202 stock\") that, if the taxpayer holds the stock for more than five years, is eligible for a 100 percent exclusion of capital gains from sale. This tax break only applies to QSB stock purchased after September 27, 2010 and before January 1, 2011.via reedsmith.comThe exclusion described above has been extended to the end of 2011.","categories":[],"tags":[]},{"title":"Find conflicting dependencies in a Maven project","slug":"2011-02-14-find-conflicting-dependencies-in-maven","date":"2011-02-14T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/02/14/2011-02-14-find-conflicting-dependencies-in-maven/","link":"","permalink":"http://ericsimmerman.com/2011/02/14/2011-02-14-find-conflicting-dependencies-in-maven/","excerpt":"","text":"The Maven dependency plugin provides nice support for resolving dependency conflicts of all types. The dependency:tree goal is particularly useful when you need to know which direct dependency of your project resulted in the import of jar X.","categories":[],"tags":[]},{"title":"Install PHP 5.3.5 with FPM (FastCGI Process Manager) support on Apache2/Centos 5.5","slug":"2011-01-21-install-php-535-with-fpm-fastcgi","date":"2011-01-21T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/01/21/2011-01-21-install-php-535-with-fpm-fastcgi/","link":"","permalink":"http://ericsimmerman.com/2011/01/21/2011-01-21-install-php-535-with-fpm-fastcgi/","excerpt":"","text":"$&gt; yum upgrade$&gt; yum groupinstall \"Development Tools\"$&gt; wget http://us2.php.net/get/php-5.3.5.tar.bz2/from/us.php.net/mirror$&gt; tar xvf php-5.3.5.tar.bz2$&gt; yum install mysql-server httpd-devel-* libxml2-devel-* openssl-devel* xmlsec1-openssl-devel-* libpng* libjpeg* curl-devel libmcrypt* mysql-devel* mysql.* libevent libevent-devel libtool-ltdl-devel libtool apr-devel apr$&gt; cd php-5.3.5$&gt; ./configure --with-mysql=shared --with-openssl --enable-pdo --with-pdo-mysql=shared --with-mhash=shared --enable-soap=shared --with-config-file-path=/etc/ --with-mysqli --enable-zip --enable-shared --with-curl --enable-mbstring=all --enable-maintainer-zts --with-jpeg-dir=/usr/lib/ --with-libdir=lib64 --enable-soap --with-pdo-mysql --with-gd --with-mcrypt --enable-fpm --with-config-file-scan-dir=/etc/php.d$&gt; make; make install;$&gt; chmod 705 /var/log/httpdEdit your php.ini to point to your new PHP's extension directory (printed as part of make install above):extension_dir = \"/usr/local/lib/php/extensions/no-debug-zts-20090626/\"Make certain your /etc/php.d directory is only loading extensions that have been built against your new php. I only load mysql and apcNow you need to tell Apache to use php-fpm via mod_fastcgi.# wget http://www.fastcgi.com/dist/mod_fastcgi-current.tar.gz# tar -zxvf mod_fastcgi-current.tar.gz# cd mod_fastcgi-2.4.6/# cp Makefile.AP2 MakefileCompile and install mod_fastcgi for 32 bit system, enter:# make top_dir=/usr/lib/httpd# make install top_dir=/usr/lib/httpdCompile and install mod_fastcgi for 64 bit system, enter:# make top_dir=/usr/lib64/httpd# make install top_dir=/usr/lib64/httpdSample output:make install top_dir=/usr/lib64/httpdmake[1]: Entering directory `/tmp/mod_fastcgi-2.4.6'/usr/lib64/apr-1/build/libtool --silent --mode=install cp mod_fastcgi.la /usr/lib64/httpd/modules/make[1]: Leaving directory `/tmp/mod_fastcgi-2.4.6'Edit your Apache config to configure mod_fastcgi:# mods-enabled/fastcgi.conf&lt;IfModule mod_fastcgi.c&gt;FastCGIExternalServer /usr/local/sbin/php-fpm -socket /tmp/php-fpm.sockAddHandler php-fastcgi .phpAction php-fastcgi /usr/local/sbin/php-fpm.fcgiScriptAlias /usr/local/sbin/php-fpm.fcgi /usr/local/sbin/php-fpm&lt;Directory /usr/local/sbin&gt;Options ExecCGI FollowSymLinksSetHandler fastcgi-scriptOrder allow,denyAllow from all&lt;/Directory&gt;&lt;/IfModule&gt;Now edit your /usr/local/etc/php-fpm config file using settings like these:[www]# socketlisten = /tmp/php-fpm.socklisten.owner = apachelisten.group = apachelisten.mode = 0666# user ID/GIDuser = apachegroup = apacheFinally, configure an autostart script for your php-fpm daemon using these instructions.","categories":[],"tags":[]},{"title":"Install Nexus 1.8.0.1 on Tomcat 6","slug":"2011-01-21-install-nexus-1801-on-tomcat-6","date":"2011-01-21T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/01/21/2011-01-21-install-nexus-1801-on-tomcat-6/","link":"","permalink":"http://ericsimmerman.com/2011/01/21/2011-01-21-install-nexus-1801-on-tomcat-6/","excerpt":"","text":"I installed on a Mac OS X server with Snow Leopard, but this applies to any Tomcat 6 installation. As discussed here, here, and lots of other places across the interwebs - the latest release of Nexus can't read its own plexus.properties under Tomcat 6. Rather than disabling the Tomcat Security Manager as a workaround, I recommend setting the applicable properties through system properties at startup. Just add something like the following to your tomcat's bin/setenv.sh script-Dplexus.nexus-work=/opt/sonatype-work/nexus","categories":[],"tags":[]},{"title":"Resolving 'org.hibernate.PropertyAccessException: IllegalArgumentException occurred calling getter'","slug":"2011-01-13-resolving-illegalargumentexception","date":"2011-01-13T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2011/01/13/2011-01-13-resolving-illegalargumentexception/","link":"","permalink":"http://ericsimmerman.com/2011/01/13/2011-01-13-resolving-illegalargumentexception/","excerpt":"","text":"After updating a named query using HQL to constrain on a Collection of objects determined at runtime, Hibernate began throwing \"org.hibernate.PropertyAccessException: IllegalArgumentException occurred calling getter\" while apparently attempting to access the \"id\" property of an object in my model.My named query looked something like this:select p from Parent p where p.child in (:children)and I was calling it like so:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;Query query = session.getNamedQuery(queryName);query.setParameter(\"children\", aCollectionOfChildren);&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;query.list();It took me a bit of trial and error to realize that Hibernate expected the Collection to be passed in using \"query.setParameterList\" instead of \"query.setParameter\". Changing my call to the following resolved the issue:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;Query query = session.getNamedQuery(queryName);query.setParameterList(\"children\", aCollectionOfChildren);&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; &nbsp;query.list();Certainly my mistake, but I sure would have appreciated a clearer error message.","categories":[],"tags":[]},{"title":"Ditch MAMP on Snow Leopard","slug":"2010-11-28-ditch-mamp-on-snow-leopard","date":"2010-11-28T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2010/11/28/2010-11-28-ditch-mamp-on-snow-leopard/","link":"","permalink":"http://ericsimmerman.com/2010/11/28/2010-11-28-ditch-mamp-on-snow-leopard/","excerpt":"","text":"I was fond of the stack XAMPP offered when I developed on Windows and lazily continued used XAMPP/MAMP once I moved to a Mac OS X based workstation. Unfortunately, the latest releases of MAMP have attempted to restrict the utility of the stack in an effort to raise revenue through a less restricted \"Pro\" version. Developers on Snow Leopard are much better off moving to standalone installations of everything MAMP offers.There are many ways to install PHP, MySQL, Apache, and phpMyAdmin - all with a list of pros/cons. Without debating the merits, here's what I did to replace MAMP:1. Dump your MAMP Mysql databases and save them for import into your standalone MySQL installmysqldump --all-databases &gt; ~/old-mysql-data.sql2. Install a more recent copy of MySQL server than the one delivered with Snow LeopardI already had macports installed, so the choice here was easy. The following command installs the mysql binaries under /opt/local/bin/port install mysql5 mysql5-server3. Import your data into your new MySQL databaseFirst, be certain to shutdown all the MAMP servers (MySQL, Apache, etc...) - then start your new standalone MySQLsudo /opt/local/bin/mysqld_safe5 &amp;Finally, run the following:mysql 4. Install phpMyAdmin on the SL delivered Apache installationInstall it fresh, or just copy your MAMP installation to ~/Sites where it will be available under http://localhost/~your-username/5. Enable PHP5 on the SL delivered Apache installationOpen /etc/apache2/httpd.conf and enable the line: \"#LoadModule php5_module libexec/apache2/libphp5.so\" by removing the pound. Then in the Mac System Pref -&gt; Sharing, turn on (or if it was already on, turn off/on) Web Sharing. If you need to move any vhost or SSL config directives from MAMP to the SL Apache install, you'll make those changes to files in /etc/apache2/extra/6. Optional - Configure PHP by creating a php.ini under /etcI'm content to use the PHP installation already delivered by SL, but there is no default php.ini - simply create one under /etc and it'll be read automatically.You can now remove the MAMP training wheels and proceed developing with full standalone versions of your stack - happy trails.","categories":[],"tags":[{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"},{"name":"macintosh","slug":"macintosh","permalink":"http://ericsimmerman.com/tags/macintosh/"}]},{"title":"Support chroot for SCP connections on CentOS 5.5","slug":"2010-11-02-support-chroot-for-scp-connections-on","date":"2010-11-02T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2010/11/02/2010-11-02-support-chroot-for-scp-connections-on/","link":"","permalink":"http://ericsimmerman.com/2010/11/02/2010-11-02-support-chroot-for-scp-connections-on/","excerpt":"","text":"Many thanks to anomie for posting this great writeup. I've pasted it below to help spread the wealth.-------Here's a quick recipe for your chrooted sftp daemon:1. Create the sftp init script - &lt;strong&gt;/etc/init.d/sftpfoo&lt;/strong&gt;#!/bin/bash## chkconfig: 35 60 25# description: OpenSSH chrooted sftp only daemon## Note that /usr/sbin/sftpfoo is simply a symlink to /usr/sbin/sshd#pidfile='/var/run/sftpfoo.pid'case \"${1}\" instart&nbsp; ) exec -a /usr/sbin/sftpfoo /usr/sbin/sshd -f /etc/ssh/sftpfoo_config;;stop&nbsp;&nbsp; ) kill -9 $(cat ${pidfile});;restart) stopsleep 3start;;*&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; ) echo \"Usage: ${0} (start|stop|restart)\";;esacexit 02. Add it to chkconfig(8) consciousness and set up a symlink you'll need later.# chkconfig --add sftpfoo# ln -s /usr/sbin/sshd /usr/sbin/sftpfoo3. Create your sftp config file - &lt;strong&gt;/etc/ssh/sftpfoo_config&lt;/strong&gt;Port 8822Protocol 2AddressFamily inetSyslogFacility AUTHPRIVLogLevel INFOPermitRootLogin noRSAAuthentication noPubkeyAuthentication noRhostsRSAAuthentication noHostbasedAuthentication noPasswordAuthentication yesPermitEmptyPasswords noChallengeResponseAuthentication noKerberosAuthentication noGSSAPIAuthentication noUsePAM noPidFile /var/run/sftpfoo.pidChrootDirectory /home/chrootedSubsystem sftp internal-sftp4. Create your first sftp-only user# useradd -d /nowhere -M -s /sbin/nologin baruser5. Create the chroot directory# mkdir -p /home/chrooted &amp;amp;&amp;amp; chmod 755 /home/chrooted6. Start the sftp service# service sftpfoo start-------Now, log in remotely as baruser, specifying port 8822. (Remember to poke a hole in your firewall for this port.)","categories":[],"tags":[]},{"title":"Resolving sleep issues with Seagate GoFlex Desk on Mac Snow Leopard","slug":"2010-10-29-resolving-sleep-issues-with-seagate","date":"2010-10-29T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2010/10/29/2010-10-29-resolving-sleep-issues-with-seagate/","link":"","permalink":"http://ericsimmerman.com/2010/10/29/2010-10-29-resolving-sleep-issues-with-seagate/","excerpt":"","text":"There are number of posts on Seagate's user forums describing frustration with the GoFlex line of external harddrive and its tendency to periodically eject/sleep on Mac's Snow Leopard. I'm using the 2TB GoFlex as my Time Machine drive and needed to resolve this annoyance as well. I've opened a ticket with Seagate Support directly, but so far they've been unable to completely resolve the issue.The only thing that seems to help is to go into System Prefs -&gt; Energy Saver and turn off the feature that puts Hard Drives to sleep. With that power saving feature disabled the Seagate only complains when my Mac actually wakes from sleep - that's an improvement but still no love.","categories":[],"tags":[]},{"title":"How to undo a SVN commit from the command line","slug":"2010-08-26-how-to-undo-svn-commit-from-command-line","date":"2010-08-26T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2010/08/26/2010-08-26-how-to-undo-svn-commit-from-command-line/","link":"","permalink":"http://ericsimmerman.com/2010/08/26/2010-08-26-how-to-undo-svn-commit-from-command-line/","excerpt":"","text":"SVN 1.4 added a feature to support easy rollback of a SVN commit. It's documented in SVN help, but unfortunately SVN help only makes sense if you already understand what it's trying to explain. Here's the easy commit revert command to run against your working copy:svn merge -c -[REV] [REPO]Replace the brackets with the offending revision number and your SVN repository respectively. For example, to undo the changes made by revision 42:svn merge -c -42 http://example.com/svn/trunk .","categories":[],"tags":[{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"}]},{"title":"I'm big in Brazil","slug":"2010-08-19-i-big-in-brazil","date":"2010-08-19T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2010/08/19/2010-08-19-i-big-in-brazil/","link":"","permalink":"http://ericsimmerman.com/2010/08/19/2010-08-19-i-big-in-brazil/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"Import GnuCash data into MoneyDance","slug":"2010-06-13-import-gnucash-data-into-moneydance","date":"2010-06-13T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2010/06/13/2010-06-13-import-gnucash-data-into-moneydance/","link":"","permalink":"http://ericsimmerman.com/2010/06/13/2010-06-13-import-gnucash-data-into-moneydance/","excerpt":"","text":"GnuCash served me well while I was running Ubuntu as my primary desktop but since moving to a Mac Pro I've been disappointed in the performance and non-native nature of the GnuCash Mac port. I decided to migrate to MoneyDance and was quickly dismayed to discover GnuCash's poor support for standards based exporting.This GnuCash wiki-entry describes a few convoluted approaches to data export but the items it references are hopelessly outdated and generally do not function for the latest stable release - reason enough to ditch GnuCash.MoneyDance hadn't solved the problem on their end either but their wiki does reference a Perl script that converts the deprecated GnuCash Postgre storage format into a MoneyDance XML file. Since I knew that the development release of GnuCash supports a SQLite storage format I decided to see if I could update Sid Reed's aforementioned script for this new SQLite container.I'm no Perl Monger, but I do know regular expressions. My updated script worked well for me and seamlessly converted several years of GnuCash data. Please read the pre-requisites section in the header of this&nbsp;GnuCash to MoneyDance Migration Script before attempting to run it. In addition to the linked zip archive, this script is also available on github. Enjoy!","categories":[],"tags":[{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"},{"name":"gnucash","slug":"gnucash","permalink":"http://ericsimmerman.com/tags/gnucash/"},{"name":"moneydance","slug":"moneydance","permalink":"http://ericsimmerman.com/tags/moneydance/"},{"name":"perl","slug":"perl","permalink":"http://ericsimmerman.com/tags/perl/"}]},{"title":"Activate a Maven Profile using Hudson","slug":"2010-06-08-activate-maven-profile-using-hudson","date":"2010-06-08T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2010/06/08/2010-06-08-activate-maven-profile-using-hudson/","link":"","permalink":"http://ericsimmerman.com/2010/06/08/2010-06-08-activate-maven-profile-using-hudson/","excerpt":"","text":"Environment properties weren't available to me on my Mac server for some reason. The solution I eventually adopted was the one used in the Cobertura Plugin docs here. Hudson by default defines a property BUILD_NUMBER which is used to enable the profile. &lt;profile&gt; &lt;id&gt;hudson&lt;/id&gt; &lt;activation&gt; &lt;property&gt; &lt;name&gt;BUILD_NUMBER&lt;/name&gt; &lt;/property&gt; &lt;/activation&gt; ...&lt;/profile&gt;","categories":[],"tags":[]},{"title":"Customize article row count for Cerberus public knowledgebase community","slug":"2010-03-14-customize-article-row-count-for","date":"2010-03-14T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2010/03/14/2010-03-14-customize-article-row-count-for/","link":"","permalink":"http://ericsimmerman.com/2010/03/14/2010-03-14-customize-article-row-count-for/","excerpt":"","text":"I've been evaluating the opensource Cerberus Helpdesk as an alternative to the closed source Kayako esupport. I like how Cerberus separates the creation of multiple knowledgebases that can then be published across multiple community portals. Instead of one comprehensive knowledgebase presented to all customers, I can use Cerberus to present product specific knowledgebases. It's a nice concept that should make it much easier for a customer to locate support information and thereby reduce the number of support tickets generated.Customizing the public facing portals for my Cerberus installation was straightforward. The admin console provided a good degree of flexibility, but I wanted a bit more so I manually modified usermeet.core/templates/portal/sc/module/index.tpl in order to insert analytics scripts and some more detailed customization. That was easy, but my next mod proved more difficult. By default, Cerberus displays 10 articles on each page of search results and I wanted to increase that count to 20. Cerberus' architecture actually makes it a bit tricky to determine the control flow used by the community portals but I eventually traced the article retrieval flow to the DAO_KbArticle class in plugins/cerberusweb.kb/api/App.php and changed the default limit on the search method from 10 to 20. The limit is set as a hardcoded constant in the method signature....yuck. After the change, 20 articles were pulled from the database on each request, but there were still only 10 displayed in the portal.It took a lot of searching to find the missing piece and it was yet another hardcoded value in plugins/cerberusweb.kb/api/sc/kb.php where $view-&gt;renderLimit was set to 10. Changing this gave me the desired row count on the portal.The Cerberus team has put together a nice product but given that one of its core competitive features is its opensource nature, I'd like to see the codebase refactored to better facilitate this type of customization. Values like these limits could easily be defined in framework.config.php instead of scattering hardcoded settings across multiple files. That said, at least I had to option to manipulate the software - something I can't do with Kayako's offering.","categories":[],"tags":[{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"},{"name":"php","slug":"php","permalink":"http://ericsimmerman.com/tags/php/"},{"name":"cerberus","slug":"cerberus","permalink":"http://ericsimmerman.com/tags/cerberus/"}]},{"title":"Connecting to Netscreen Series (NetScreen-5) VPN with Mac OS X (Snow Leopard)","slug":"2010-03-05-connecting-to-netscreen-series","date":"2010-03-05T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2010/03/05/2010-03-05-connecting-to-netscreen-series/","link":"","permalink":"http://ericsimmerman.com/2010/03/05/2010-03-05-connecting-to-netscreen-series/","excerpt":"","text":"(Followup to my NetScreen-5 from Ubuntu article) I recently struggled through the details of establishing a VPN connection from my Mac OS X desktop to a Juniper Networks Netscreen-5. Here's how I solved it. My Netscreen-5 was configured with some typical settings:Phase 1Pre-shared key \"your-pre-shared-key-here\"Encryption \"pre-g2-aes128-sha\"Phase 2 Encryption \"g2-esp-3des-sha\"To configure the client-side using an Ubuntu desktop, I used Racoon and KVpnc but didn't have the luxury of KVpnc on my Mac desktop so I had to manually edit my racoon.conf: log debug2;path pre_shared_key &quot;/etc/racoon/psk.txt&quot;;path certificate &quot;/etc/racoon/certs&quot;;timer{ natt_keepalive 10 sec;}remote VPN.GATEWAY{ exchange_mode aggressive; nat_traversal on; ike_frag on; peers_identifier asn1dn; proposal_check obey; my_identifier user_fqdn &quot;YOUR.EMAIL.ADDRESS&quot;; proposal { encryption_algorithm aes; hash_algorithm sha1; authentication_method pre_shared_key; dh_group modp1024; }}sainfo address DESKTOP.IP.ADDRESS/32 any address VPN.GATEWAY/28 any{ pfs_group modp1024; encryption_algorithm 3des; authentication_algorithm hmac_sha1; compression_algorithm deflate;}listen{ adminsock &quot;/var/run/racoon.sock&quot; &quot;root&quot; &quot;operator&quot; 0660;}","categories":[],"tags":[{"name":"macintosh","slug":"macintosh","permalink":"http://ericsimmerman.com/tags/macintosh/"},{"name":"networks","slug":"networks","permalink":"http://ericsimmerman.com/tags/networks/"}]},{"title":"Select max value of numeric CollectionOfElements with Hibernate","slug":"2010-02-23-select-max-value-of-numeric","date":"2010-02-23T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2010/02/23/2010-02-23-select-max-value-of-numeric/","link":"","permalink":"http://ericsimmerman.com/2010/02/23/2010-02-23-select-max-value-of-numeric/","excerpt":"","text":"Consider a numeric CollectionOfElements held by a class Product such as: @Entity(name=&quot;Product&quot;)public class Product {protected Set serialNumbers = new HashSet();@CollectionOfElements@JoinTable(name=&quot;product_serialnumbers&quot;)public Set getSerialNumbers() { return serialNumbers;}public void setSerialNumbers(Set serialNumbers) { this.serialNumbers = serialNumbers;}}You can use a NamedQuery to determine the maximum SerialNumber held by any Product like this: @Entity(name=&quot;Product&quot;)@NamedQueries ({ @NamedQuery( name = &quot;maxSerialNumber&quot;, query = &quot;select max(elements(p.serialNumbers)) as value from Product p&quot; )})public class Product {protected Set serialNumbers = new HashSet();@CollectionOfElements@JoinTable(name=&quot;product_serialnumbers&quot;)public Set getSerialNumbers() { return serialNumbers;}public void setSerialNumbers(Set serialNumbers) { this.serialNumbers = serialNumbers;}}","categories":[],"tags":[{"name":"java","slug":"java","permalink":"http://ericsimmerman.com/tags/java/"},{"name":"hibernate","slug":"hibernate","permalink":"http://ericsimmerman.com/tags/hibernate/"}]},{"title":"Eclipse Galileo unable to read Subversion repository","slug":"2010-01-18-eclipse-galileo-unable-to-read","date":"2010-01-18T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2010/01/18/2010-01-18-eclipse-galileo-unable-to-read/","link":"","permalink":"http://ericsimmerman.com/2010/01/18/2010-01-18-eclipse-galileo-unable-to-read/","excerpt":"","text":"After a clean Snow Leopard install on a new machine, I fired up a fresh Galileo Eclipse and pointed it at a copy of my old workspace.&nbsp; I first encountered and resolved the missing Mac OS X JRE issue described in my last post, only to then find that my existing subversion repositories were inaccessible in the new Eclipse install. I hopefully added \"-clean\" as the first parameter of my eclipse.ini file and restarted but the situation remained unchanged. Undeterred, I launched eclipse from the command line with a -clean startup parameter and this did the trick:/Applications/&lt;your install dir/Eclipse.app/Contents/MacOS/eclipse -clean","categories":[],"tags":[{"name":"java","slug":"java","permalink":"http://ericsimmerman.com/tags/java/"},{"name":"macintosh","slug":"macintosh","permalink":"http://ericsimmerman.com/tags/macintosh/"},{"name":"eclipse","slug":"eclipse","permalink":"http://ericsimmerman.com/tags/eclipse/"},{"name":"subversive","slug":"subversive","permalink":"http://ericsimmerman.com/tags/subversive/"},{"name":"snowleopard","slug":"snowleopard","permalink":"http://ericsimmerman.com/tags/snowleopard/"}]},{"title":"Missing MacOS X VM in Eclipse Galileo on Snow Leopard","slug":"2010-01-18-missing-macos-x-vm-in-eclipse-galileo","date":"2010-01-18T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2010/01/18/2010-01-18-missing-macos-x-vm-in-eclipse-galileo/","link":"","permalink":"http://ericsimmerman.com/2010/01/18/2010-01-18-missing-macos-x-vm-in-eclipse-galileo/","excerpt":"","text":"I recently encountered an issue where I was unable to add a JVM to my Eclipse install on Snow Leopard. There was no MacOS X VM option under Installed JREs -&gt; Add and attempting to use the Standard VM resulted in an error. After digging around in Eclipse bug reports, I discovered this is a known issue with the Cocoa build of Galileo with PDT pre-installed.&nbsp; The easy fix is to install Eclipse without PDT (just install the Eclipse IDE for Java - Cocoa 64 bit) and add PDT plugin later. When you take this route, the MacOS X VM will be configured automagically.","categories":[],"tags":[{"name":"java","slug":"java","permalink":"http://ericsimmerman.com/tags/java/"},{"name":"macintosh","slug":"macintosh","permalink":"http://ericsimmerman.com/tags/macintosh/"},{"name":"eclipse","slug":"eclipse","permalink":"http://ericsimmerman.com/tags/eclipse/"},{"name":"snowleopard","slug":"snowleopard","permalink":"http://ericsimmerman.com/tags/snowleopard/"}]},{"title":"Copy/Paste clipboard broken on Snow Leopard","slug":"2009-12-19-copypaste-clipboard-broken-on-snow","date":"2009-12-19T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/12/19/2009-12-19-copypaste-clipboard-broken-on-snow/","link":"","permalink":"http://ericsimmerman.com/2009/12/19/2009-12-19-copypaste-clipboard-broken-on-snow/","excerpt":"","text":"After a recent Apple update, copy and paste quit functioning on my Snow Leopard install. After a number of red herrings, I eventually traced the issue to Synergy and noticed that synergyc constantly emptied my clipboard immediately after any copy operation. I was running synergy 1.3.1 at the time which was released back in 2006 - I was hopeful that the latest release of the Synergy fork Synergy Plus might provide a quick solution.An install of synergy-plus 1.3.4 Darwin binary did not resolve the issue and a build of the latest from subversion (r252) would not run for me (separate issue - synergyc unable to resolve server address).I happened upon this thread in my search for an answer and based on comments there decided to build revision 242 for my Mac client and run 252 on my Ubuntu server. Happy to report it resolved my issues.One note - I was thrown for a bit when my first Xcode build resulted in 14 compile time errors. Turns out it was necessary for me to build for i386 as the 64-bit build would not compile for me.UPDATE: After a couple weeks use, I found the synergy-plus binary to be rather buggy and went in search of a solution. MacPorts supports a patched build of synergy 1.3.1 for Snow Leopard and so far it is working beautifully. Assuming you have ports installed, the following will install the tried and true synergy.port clean synergy ; port install synergy +universal","categories":[],"tags":[{"name":"macintosh","slug":"macintosh","permalink":"http://ericsimmerman.com/tags/macintosh/"},{"name":"synergy","slug":"synergy","permalink":"http://ericsimmerman.com/tags/synergy/"}]},{"title":"Subversion, Jira, Sonar, Hudson & Fisheye on Mac OSX Server with Snow Leopard","slug":"2009-11-06-subversion-jira-sonar-hudson-fisheye-on","date":"2009-11-06T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/11/06/2009-11-06-subversion-jira-sonar-hudson-fisheye-on/","link":"","permalink":"http://ericsimmerman.com/2009/11/06/2009-11-06-subversion-jira-sonar-hudson-fisheye-on/","excerpt":"","text":"Here are some notes from the field on setting up all these development services to play nice on Mac OS X Server 10.6:Use this excellent writeup from Apple to get Subversion setup as a webservice. Note the comment about how the DAV setting can revert to DAV no and need correction. I've found that it sometimes reverts to \"DAV On\" and this will break your subversion service...it must always be set to DAV svnConfigure Jira using Server Admin's \"Sites\" panel for configuring the Web service. Under Sites-&gt;Proxy configure an ajp worker to talk to your Jira instance. I installed jira on its own context /jira as opposed to root and therefore set the worker URL path as well as the Proxy Path to /jiraFor running under the same hostname/virtual host any additional balancer groups will need to be configured manually. I was able to configure an ajp balancer for sonar but had to use a http balancer for hudson. Avoid using 8443 for your ports for any customer services as Apple's iCal is configured for this one by default.","categories":[],"tags":[{"name":"macintosh","slug":"macintosh","permalink":"http://ericsimmerman.com/tags/macintosh/"}]},{"title":"Installing python-mysql connector MySQLdb after Snow Leopard upgrade","slug":"2009-10-23-installing-python-mysql-connector","date":"2009-10-23T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/10/23/2009-10-23-installing-python-mysql-connector/","link":"","permalink":"http://ericsimmerman.com/2009/10/23/2009-10-23-installing-python-mysql-connector/","excerpt":"","text":"After upgrading to Snow Leopard and all its 64-bit goodness, I discovered that the upgrade to python 2.6.1 64-bit understandably broke my python-mysql connector which was previously compiled against my 32-bit installation of XAMPP with MySQL. I tried several different paths to make the new python play nice with the existing XAMPP installation. Here's the one that worked:Insure that you have the MySQL include directory needed for compilation against the XAMPP MySQL binary you are running. I'm running a 5.0.x build of MySQL and to get the proper include dir I simply downloaded the 32-bit DMG for Mac from here. After installation, I simply copied the include dir to my xampp installation. cp -R /usr/local/mysql/include /Applications/xampp/xamppfiles/Now the xampp version of mysql_config will point to your newly installed include dir, so you are ready to compile against it.If you don't already have it, grab the python-mysql connector source. I'm using MySQL-python-1.2.3c1Tell your 64-bit python to always run in 32-bit mode defaults write com.apple.versioner.python Prefer-32-Bit -bool yescd into the MySQL-python source directory and build it for 32-bit mode ARCHFLAGS='-arch i386' python setup.py buildinstall it ARCHFLAGS='-arch i386' python setup.py installexit the source directory \"cd ~\" and test your new install pythonPython 2.6.1 (r261:67515, Jul 7 2009, 23:51:51)[GCC 4.2.1 (Apple Inc. build 5646)] on darwinType &quot;help&quot;, &quot;copyright&quot;, &quot;credits&quot; or &quot;license&quot; for more information.&gt;&gt;&gt; import MySQLdbYou're welcome.","categories":[],"tags":[{"name":"macintosh","slug":"macintosh","permalink":"http://ericsimmerman.com/tags/macintosh/"}]},{"title":"Resolving a 'CA key usage check failed: keyCertSign bit is not set' error in Tomcat","slug":"2009-10-22-resolving-key-usage-check-failed","date":"2009-10-22T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/10/22/2009-10-22-resolving-key-usage-check-failed/","link":"","permalink":"http://ericsimmerman.com/2009/10/22/2009-10-22-resolving-key-usage-check-failed/","excerpt":"","text":"After installing a new GoDaddy SSL certificate in Tomcat 5.5.x my web browsers were able to properly negotiate SSL connections, but when back-end code attempted (specifically when CAS attempted to validate a ticket through Cas20ServiceTicketValidator) to connect using SSL the \"CA key usage check failed: keyCertSign bit is not set\" error was being thrown. My tomcat server is fronted by Apache2 and Apache handles SSL negotiation. I discovered that I had improperly installed the intermediate certificate for GoDaddy and while modern browsers just ignored the resulting misconfiguration, Java was complaining.I had set the SSLCertificateChainFile directive to point to the \"cert-chain.crt\" file. The mistake is understandable given the near identical naming of the directive and the file...but alas that intuitive connection is erroneous. The directive instead needs to point to the gd_intermediate.crt file that GoDaddy also provides. Here's what my correct config looks like on RHEL5: SSLCertificateChainFile /etc/pki/tls/certs/gd_intermediate.crt","categories":[],"tags":[{"name":"java","slug":"java","permalink":"http://ericsimmerman.com/tags/java/"},{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"}]},{"title":"Compiling mod_caucho on RHEL 5.3","slug":"2009-09-14-compiling-modcaucho-on-rhel-53","date":"2009-09-14T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/09/14/2009-09-14-compiling-modcaucho-on-rhel-53/","link":"","permalink":"http://ericsimmerman.com/2009/09/14/2009-09-14-compiling-modcaucho-on-rhel-53/","excerpt":"","text":"There is a known issue with APR that prevents the compilation of mod_caucho on RHEL 5.3 out of the box. Additionally, for some reason my installation of APR uses the name \"apr-1-config\" instead of \"apr-config\" so that to compile mod_caucho I had to do the following:Run configure --with-apxsExecute 'apr-config --cppflags --cflags'On my server this resulted in '-DLINUX=2 -D_REENTRANT -D_GNU_SOURCE -D_LARGEFILE64_SOURCE -pthread'Append the output of the above command to the \"CFLAGS\" line in config.statusRun make; make install;FYI, I also had to overwrite the \"plugins\" variable in the Resin configure script to manually set apache2 because the script was detecting and using apache1","categories":[],"tags":[{"name":"java","slug":"java","permalink":"http://ericsimmerman.com/tags/java/"},{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"}]},{"title":"Running Skype on Snow Leopard - RESOLVED","slug":"2009-09-05-running-skype-on-snow-leopard-resolved","date":"2009-09-05T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/09/05/2009-09-05-running-skype-on-snow-leopard-resolved/","link":"","permalink":"http://ericsimmerman.com/2009/09/05/2009-09-05-running-skype-on-snow-leopard-resolved/","excerpt":"","text":"After installing the latest Mac OSX upgrade Skype began giving me trouble. I found this thread in Skype's forums which attests to the issue. Downgrading to 2.7.0 is suggested as a solution there, but it did not work for me. The downgraded version still locked-up and refused to quit without a force. However, I kept 2.7.0.330 installed and convinced OS X to install Rosetta (it prompted me for the install automatically when I attempted to launch Photoshop). After the Rosetta install and reboot, Skype 2.7.0.330 functioned properly for a few sessions and then fell down taking the whole kernel with it via the black screen of death. I've since upgraded to 2.8.0.659 which doesn't seem to crash but just stops working occasionally. The symptom exhibited is that messages stay in the \"pending...\" state and are simply never delivered.UPDATE: I've resolved my issues by explicitly opening the Skype inbound port (the default is 65269 and it's configurable under Preferences -&gt; Advanced) in my firewall. This was not needed until I upgraded to Snow Leopard but apparently is now required to keep Skype functioning properly. I maintain a custom firewall configuration using /sbin/ipfw and I added the following line to /etc/rc.firewall to open the Skype inbound port. add 3020 allow log tcp from any to any 65269 inAfter saving that and restarting ipfw Skype is functioning as expected.","categories":[],"tags":[{"name":"macintosh","slug":"macintosh","permalink":"http://ericsimmerman.com/tags/macintosh/"}]},{"title":"Improving VirtualBox performance","slug":"2009-08-14-improving-virtualbox-performance","date":"2009-08-14T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/08/14/2009-08-14-improving-virtualbox-performance/","link":"","permalink":"http://ericsimmerman.com/2009/08/14/2009-08-14-improving-virtualbox-performance/","excerpt":"","text":"I run VirtualBox on an Ubuntu 64-bit Host with a 32-bit Windows XP guest. I was searching for a way to boost performance and came across this post related to configuring a SATA controller for drive access. Matt includes some great info there, but the step-by-step left something to be desired IMHO. Here are my revised instructions for configuring SATA support on your Win XP guest:Start VirtualBox, but do not boot your guest.Open Settings for your Win XP guest and select \"Hard Disks\"Check \"Enable Additional Controller\" and choose \"SATA (AHCI)\"Save your Settings changes and boot your guestInside your guest, download the appropriate SATA controller software from IntelInstall the Intel softwareShutdown your guestGo back into VirtualBox Settings for your guest. Select Harddrives again.Now change the slot associated with your Windows XP attachments/harddisk(s) from IDE to \"SATA Port 0\"Save your settingsStart your guest and enjoy the performance boost!","categories":[],"tags":[{"name":"ubuntu","slug":"ubuntu","permalink":"http://ericsimmerman.com/tags/ubuntu/"}]},{"title":"Spring Security ACL intercept-methods with transaction advice","slug":"2009-08-13-spring-security-acl-intercept-methods","date":"2009-08-13T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/08/13/2009-08-13-spring-security-acl-intercept-methods/","link":"","permalink":"http://ericsimmerman.com/2009/08/13/2009-08-13-spring-security-acl-intercept-methods/","excerpt":"","text":"I recently used Spring to configure a manager to use Spring Security ACL method-level authorization. Here's a snip of my initial manager bean config: &lt;bean id=&quot;clientManager&quot; class=&quot;com.acme.service.impl.ClientManagerImpl&quot;&gt; &lt;sec:intercept-methods access-decision-manager-ref=&quot;accessDecisionManager&quot;&gt; &lt;sec:protect method=&quot;get&quot; access=&quot;AFTER_ACL_READ&quot;/&gt; &lt;sec:protect method=&quot;save&quot; access=&quot;ROLE_ADMIN,ACL_WRITE&quot;/&gt; &lt;/sec:intercept-methods&gt; &lt;constructor-arg ref=&quot;clientDao&quot;/&gt; &lt;property name=&quot;mutableAclService&quot; ref=&quot;aclService&quot;/&gt;&lt;/bean&gt;With this configuration, my unit tests verified that the method-level authorization was working as expected. Next, I applied some declarative transaction management to the same manager: &lt;aop:config&gt; &lt;aop:advisor id=&quot;managerTx&quot; advice-ref=&quot;txAdvice&quot; pointcut=&quot;execution(* *..service.*Manager.*(..))&quot; order=&quot;0&quot;/&gt;&lt;/aop:config&gt;&lt;tx:advice id=&quot;txAdvice&quot;&gt; &lt;tx:attributes&gt; &lt;tx:method name=&quot;get*&quot; read-only=&quot;true&quot;/&gt; &lt;tx:method name=&quot;save*&quot; rollback-for=&quot;DuplicateNameException,UserExistsException&quot; /&gt; &lt;tx:method name=&quot;*&quot;/&gt; &lt;/tx:attributes&gt;&lt;/tx:advice&gt;After adding this transaction advice, my unit tests failed method-level authorization checks. I never traced the issue to its absolute root cause, but based upon some open tickets against Spring I believe the error was due to a \"double-proxy\" type issue. The short story is that proxies are final, and Spring can't proxy a proxy...Regardless of the root cause, I found a reasonable workaround was to revert to one of the \"old\" (more verbose) methods of transaction demarcation. Here's what my final working configuration looks like: &lt;bean id=&quot;baseTransactionProxy&quot; abstract=&quot;true&quot; class=&quot;org.springframework.transaction.interceptor.TransactionProxyFactoryBean&quot;&gt; &lt;property name=&quot;transactionManager&quot; ref=&quot;transactionManager&quot;/&gt; &lt;property name=&quot;transactionAttributes&quot;&gt; &lt;props&gt; &lt;prop key=&quot;get*&quot;&gt;PROPAGATION_REQUIRED,readOnly&lt;/prop&gt; &lt;prop key=&quot;save*&quot;&gt;PROPAGATION_REQUIRED,-DuplicateNameException,-UserExistsException&lt;/prop&gt; &lt;prop key=&quot;*&quot;&gt;PROPAGATION_REQUIRED&lt;/prop&gt; &lt;/props&gt; &lt;/property&gt;&lt;/bean&gt;&lt;bean id=&quot;clientManager&quot; parent=&quot;baseTransactionProxy&quot;&gt; &lt;property name=&quot;target&quot;&gt; &lt;bean class=&quot;com.acme.service.impl.ClientManagerImpl&quot;&gt; &lt;sec:intercept-methods access-decision-manager-ref=&quot;accessDecisionManager&quot;&gt; &lt;sec:protect method=&quot;get&quot; access=&quot;AFTER_ACL_READ&quot;/&gt; &lt;sec:protect method=&quot;save&quot; access=&quot;ROLE_ADMIN,ACL_WRITE&quot;/&gt; &lt;/sec:intercept-methods&gt; &lt;constructor-arg ref=&quot;clientDao&quot;/&gt; &lt;property name=&quot;mutableAclService&quot; ref=&quot;aclService&quot;/&gt; &lt;/bean&gt; &lt;/property&gt;&lt;/bean&gt;By leveraging the TransactionProxyFactoryBean directly instead of relying upon the tx:advice and aop:config tags, I was able to wrap my Spring ACL secured methods with declarative transactions. Nice.","categories":[],"tags":[{"name":"java","slug":"java","permalink":"http://ericsimmerman.com/tags/java/"},{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"}]},{"title":"OpenSSL alert 40 Handshake error 'no common encryption algorithms' with Caucho's Resin","slug":"2009-07-23-openssl-alert-40-handshake-error-common","date":"2009-07-23T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/07/23/2009-07-23-openssl-alert-40-handshake-error-common/","link":"","permalink":"http://ericsimmerman.com/2009/07/23/2009-07-23-openssl-alert-40-handshake-error-common/","excerpt":"","text":"Setting up my new QA server should have been simple, but a cryptic issue with Resin cost me five hours. Here's the rundown so you can learn from my pain.I copied my production copy of Resin over to a new QA server which is more or less identical - both run RHEL5 with the same version of openssl and same Java runtime. It fired up an ran perfectly...there were only two things I wanted to change. I wanted to:Upgrade to the latest version of Resin - from 3.1.7 to 3.1.9Install a new SSL certificate to match the QA server's hostnameThe task at hand looked so simple I decided to make both changes at once without testing in between....big mistake. I flew through the upgrade process and grabbed a new certificate from GoDaddy (the same CA used for the existing certificate). When I fired up the new Resin it started with no errors but when I attempted to pull a page over SSL my browser returned a \"no common encryption algorithms\" error.I thought support for certain algorithms must have changed in the latest release and thus spent an inordinate amount of time chasing my tail in the belief that the issue was related to the Resin minor version upgrade. After recognizing that dead-end, I ran through every openssl test I knew and learned a few more along the way. After much trial and error I finally noticed my mistake. I was still using the certificate-chain-file associated with the production certificate.The first certificate in a certificate chain file is your server/domain certificate. Thus, I needed to replace the first certificate in the chain in order to use it with my QA server. That took two minutes...then all was well with SSL support in my new QA server.","categories":[],"tags":[{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"}]},{"title":"Malfunctioning mouse after upgrade to Ubuntu 8.10","slug":"2009-07-18-malfunctioning-mouse-after-upgrade-to","date":"2009-07-18T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/07/18/2009-07-18-malfunctioning-mouse-after-upgrade-to/","link":"","permalink":"http://ericsimmerman.com/2009/07/18/2009-07-18-malfunctioning-mouse-after-upgrade-to/","excerpt":"","text":"I experienced some intermittent and infuriating mouse malfunctions after my upgrade to Ubuntu 8.10. Single-clicks were interpreted as double-clicks, hilighted selections would lose focus, etc...The root cause was an incomplete transition to HAL. Upgrade manager attempted but failed to comment out all my pointer and keyboard configuration in xorg.conf and my mouse was thus configured twice (once using the old-school xorg method and a second time by HAL). The fix was simple:Edit /etc/X11/xorg.conf and remove any references to keyboard or mouse devices in the \"ServerLayout\" sectionInputDevice \"Generic Keyboard\"InputDevice \"Configured Mouse\"Also remove any Keyboard or Mouse sections within the xorg.confHit Ctrl+Alt+F1 to drop to a shell and type \"sudo xinit -- :2\" to test your new configCorrect any errors as needed until the above starts a new windows session with a simple command promptHit Ctrl+Alt+F1 to switch back to your test session and Ctrl-C to kill the second windows instanceRestart your primary GDM with your new config \"sudo /etc/init.d/gdm restart\"","categories":[],"tags":[{"name":"ubuntu","slug":"ubuntu","permalink":"http://ericsimmerman.com/tags/ubuntu/"}]},{"title":"Belkin Surge Protector Fire Hazard","slug":"2009-06-28-belkin-surge-protector-fire-hazard","date":"2009-06-28T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/06/28/2009-06-28-belkin-surge-protector-fire-hazard/","link":"","permalink":"http://ericsimmerman.com/2009/06/28/2009-06-28-belkin-surge-protector-fire-hazard/","excerpt":"","text":"Dear US Consumer Product Safety CommissionCC: everyone On the morning of June 27th 2009, electrical power to my household was briefly disrupted around 3:30am by several breaks in service over a period of about 20 seconds. Approximately 5 minutes after the disruption, I noticed thick black smoke billowing from a room housing several electronic devices. I was able to enter the room and identify the source of the smoke as the burning plastic of my Belkin \"Conceal\" Surge Protector. I was thankfully able to quickly terminate power to the device and remove the smoldering plastic from my home.As the attached photos demonstrate, the heat from the Belkin burned several holes into the baseboard of the wall behind it and charred the surrounding floor and wall. At the time of the incident, there were only three devices plugged into the Belkin: a speaker, halogen lamp, and laptop computer. Both the speaker and lamp were powered off and the laptop was only drawing power as needed to replenish its battery. Aside from damage to their power cords all three devices were unharmed. I purchased this Belkin Surge Protector from Staples on July 25th 2007 (I have the original receipt) and it was never damaged, repaired, or modified in any way prior to this incident.My wife &amp; eight-week old daughter were present in our home with me at the time of this incident. In addition to the obvious structural damage pictured, the room suffered significant smoke damage &amp; lingering odors from the toxic fumes. Clearly my family and I are lucky to have only experienced this relatively minor loss from such a potentially harmful incident. I am writing you today in the hope that this information may prevent other consumers from exposure to this potentially lethal &amp; hazardous product.I have kept the product and would be happy to submit it for your inspection. The particulars of my Belkin are:Model: BZ 111234-10File No: E89769Serial: 061016716-18079Manufactured: Sept 02, 2006Made in China","categories":[],"tags":[]},{"title":"Resolve foreign key constraint error/conflict with DBUnit CLEAN_INSERT operation (MySQLIntegrityConstraintViolationException)","slug":"2009-06-17-resolve-foreign-key-constraint","date":"2009-06-17T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/06/17/2009-06-17-resolve-foreign-key-constraint/","link":"","permalink":"http://ericsimmerman.com/2009/06/17/2009-06-17-resolve-foreign-key-constraint/","excerpt":"","text":"If DBUnit starts throwing MySQLIntegrityConstraintViolationException while performing a CLEAN_INSERT you can lose quite a bit of sleep attempting to resolve it or you can cheat and get back to work. The shortcut is to simply disable constraints for the INSERT operation by disabling constraints for DBUnit altogether. You can do that by adding sessionVariables=FOREIGN_KEY_CHECKS=0 to your JDBC connection string to MySQL. I use maven and in pom.xml my configuration for the dbunit plugin looks like this &lt;groupId&gt;org.codehaus.mojo&lt;/groupId&gt;&lt;artifactId&gt;dbunit-maven-plugin&lt;/artifactId&gt;&lt;version&gt;1.0-beta-1&lt;/version&gt;&lt;configuration&gt; &lt;dataTypeFactoryName&gt;${dbunit.dataTypeFactoryName}&lt;/dataTypeFactoryName&gt; &lt;driver&gt;${jdbc.driverClassName}&lt;/driver&gt; &lt;username&gt;${jdbc.username}&lt;/username&gt; &lt;password&gt;${jdbc.password}&lt;/password&gt; &lt;url&gt;${jdbc.url}&amp;amp;sessionVariables=FOREIGN_KEY_CHECKS=0&lt;/url&gt; &lt;src&gt;src/test/resources/sample-data.xml&lt;/src&gt; &lt;type&gt;${dbunit.operation.type}&lt;/type&gt; &lt;schema&gt;${dbunit.schema}&lt;/schema&gt; &lt;skip&gt;${maven.test.skip}&lt;/skip&gt;&lt;/configuration&gt;Keep in mind that if you choose to do this your dbunit tests will run with constraints disabled....generally not a recommended approach. Caveat Emptor.","categories":[],"tags":[{"name":"java","slug":"java","permalink":"http://ericsimmerman.com/tags/java/"},{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"},{"name":"dbunit","slug":"dbunit","permalink":"http://ericsimmerman.com/tags/dbunit/"}]},{"title":"Using jQuery and Scriptaculous/prototype together","slug":"2009-06-01-using-jquery-and-scriptaculousprototype","date":"2009-06-01T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/06/01/2009-06-01-using-jquery-and-scriptaculousprototype/","link":"","permalink":"http://ericsimmerman.com/2009/06/01/2009-06-01-using-jquery-and-scriptaculousprototype/","excerpt":"","text":"Congratulations to the jQuery crew for properly documenting this one in their official documentation. However, I didn't find that page with my first search so consider this post my effort to propagate the knowledge.jQuery uses \"$\" as a shortcut for \"jQuery\" and that is generally its only point of conflict with other javascript libraries. You can override that behavior so that jQuery will play nice with others by calling jQuery.noConflict();and then explicitly calling \"jQuery\" where you would have used \"$\" to invoke jQuery behavior. Read more on the page referenced above.","categories":[],"tags":[{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"},{"name":"scriptaculous","slug":"scriptaculous","permalink":"http://ericsimmerman.com/tags/scriptaculous/"},{"name":"jquery","slug":"jquery","permalink":"http://ericsimmerman.com/tags/jquery/"}]},{"title":"Rolling back from Subversive 0.7.8 in Eclipse Ganymede","slug":"2009-05-14-rolling-back-from-subversive-078-in","date":"2009-05-14T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/05/14/2009-05-14-rolling-back-from-subversive-078-in/","link":"","permalink":"http://ericsimmerman.com/2009/05/14/2009-05-14-rolling-back-from-subversive-078-in/","excerpt":"","text":"I've had automatic updates enabled on my Ganymede install of Eclipse. Huge mistake. Today a Subversive upgrade moved me into an unworkable state and I lost some development time recovering. My experience seems similar to the problem discussed here. Even a fresh install of Eclipse failed to correct the situation. Maddening!In any event, here's how I was able to finally recover:Open Time MachineRestore ~/.eclipsePat self on back for using a MacWhat? You don't use a Mac? Why? Well, you might be able to use Eclipse's Software Updates -&gt; Installed Software -&gt; Revert Configuration button to rollback the upgrade. Good luck with that...","categories":[],"tags":[{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"},{"name":"eclipse","slug":"eclipse","permalink":"http://ericsimmerman.com/tags/eclipse/"},{"name":"subversive","slug":"subversive","permalink":"http://ericsimmerman.com/tags/subversive/"}]},{"title":"Connecting to Netscreen Series (NetScreen-5) VPN with Ubuntu 9.04 (Jaunty - AMD64)","slug":"2009-05-13-connecting-to-netscreen-series","date":"2009-05-13T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/05/13/2009-05-13-connecting-to-netscreen-series/","link":"","permalink":"http://ericsimmerman.com/2009/05/13/2009-05-13-connecting-to-netscreen-series/","excerpt":"","text":"I recently struggled through the details of establishing a VPN connection from my Ubuntu 64 desktop to a Juniper Networks Netscreen-5. There are a number of ways to skin the VPN cat in linux and I'm not going to detail them all here. I'll just tell you how I solved it.My Netscreen-5 was configured with some typical settings: Phase 1Pre-shared key &quot;your-pre-shared-key-here&quot;Encryption &quot;pre-g2-aes128-sha&quot;Phase 2Encryption &quot;g2-esp-3des-sha&quot;To configure the client-side, I decided to use Racoon and KVpnc:On my Jaunty install (Ubuntu 9.04) I first installed the repository version of racoon: apt-get install racoonThen I downloaded the latest build of KVpnc. They only had an intrepid build when I wrote this (kvpnc_0.9.1_intrepid-1_amd64.deb) and it worked for me, but it's worth checking if a Jaunty build is available.My Netscreen config translates to the following choices under KVpnc's Racoon options:sha1aeshmac_sha1aesagressivemodp1024modp1024Remote Identifier Type: asn1dnLocal Identifier Type: user_fqdnLocal Identifier Value: (we used email addresses for client ids on the netscreen so the Local Identifier value in KVpnc is an email address)Your VPN gateway is entered under General and don't forget to complete the Network/General portion of your KVpnc profile as well. That's where your destination network goes (for a Host to Network configuration like mine).","categories":[],"tags":[{"name":"ubuntu","slug":"ubuntu","permalink":"http://ericsimmerman.com/tags/ubuntu/"},{"name":"vpn","slug":"vpn","permalink":"http://ericsimmerman.com/tags/vpn/"}]},{"title":"Calling PHP from Ruby and reading STDOUT","slug":"2009-04-13-calling-php-from-ruby-and-reading-stdout","date":"2009-04-13T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/04/13/2009-04-13-calling-php-from-ruby-and-reading-stdout/","link":"","permalink":"http://ericsimmerman.com/2009/04/13/2009-04-13-calling-php-from-ruby-and-reading-stdout/","excerpt":"","text":"PHP and Ruby syntax are far enough apart that I was loathe to attempt a port of some working PHP scripts in my arsenal, but I needed to call said scripts from a relatively complex Ruby program. Fast &amp; dirty integration of this type is generally performed using a system call, but unlike most things Ruby I didn't find the Ruby way in this case to be all that intuitive.The %x technique for the system call made it easy to read the output of my PHP program into a variable in the calling script. The real trick was finding the correct syntax for passing a parameter to the %x call as shown below.Learn from my studies grasshopper: avariableparameter = &quot;--o ipso -v lorem&quot;result = %x[php /path/to/script.php &quot;#{avariableparameter}&quot;]","categories":[],"tags":[{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"},{"name":"ruby","slug":"ruby","permalink":"http://ericsimmerman.com/tags/ruby/"},{"name":"php","slug":"php","permalink":"http://ericsimmerman.com/tags/php/"}]},{"title":"Fix for KeePassX window positioning off screen after changing monitors","slug":"2009-04-06-fix-for-keepassx-window-positioning-off","date":"2009-04-06T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/04/06/2009-04-06-fix-for-keepassx-window-positioning-off/","link":"","permalink":"http://ericsimmerman.com/2009/04/06/2009-04-06-fix-for-keepassx-window-positioning-off/","excerpt":"","text":"After removing a secondary monitor from a MacBook, some apps do not properly re-position themselves on your laptop display. KeePassX is one such offender and I was previously manually editing ~/.keepass/config and restarting KeePassX in order to resolve the issue.I came across a much nicer solution on bittube. The solution is great, but the source found there is a bit tricky to copy &amp; paste so I've re-posted here for posterity. Enjoy! property processesToIgnore : {}tell application &quot;Finder&quot;set _b to bounds of window of desktopset screen_width to item 3 of _bset screen_height to item 4 of _bend telltell application &quot;System Events&quot;set allProcesses to application processesset _results to &quot;&quot;repeat with i from 1 to count allProcessesset doIt to 1repeat with z from 1 to count processesToIgnoreif process i = process (item z of processesToIgnore) thenset doIt to 0end ifend repeatif doIt = 1 thentell process irepeat with x from 1 to (count windows)set winPos to position of window xset _x to item 1 of winPosset _y to item 2 of winPosif (_x &lt; 0 or _y screen_width or _y &gt; screen_height) thenset position of window x to {0, 22}end ifend repeatend tellend ifend repeatend tell","categories":[],"tags":[{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"},{"name":"keepassx","slug":"keepassx","permalink":"http://ericsimmerman.com/tags/keepassx/"}]},{"title":"Resolving Synergy mouse issues with Firefox after upgrade to Ubuntu 8.04","slug":"2009-04-03-resolving-synergy-mouse-issues-with","date":"2009-04-03T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/04/03/2009-04-03-resolving-synergy-mouse-issues-with/","link":"","permalink":"http://ericsimmerman.com/2009/04/03/2009-04-03-resolving-synergy-mouse-issues-with/","excerpt":"","text":"My desktop runs Ubuntu (64-bit) and I use Synergy to drive its keyboard and mouse over to various clients like my MacBook Pro.After my upgrade to Ubuntu 8.04 my Synergy-driven mouse exhibited truly bizarre behavior while interacting with Firefox on my Mac. DHTML didn't function normally, dropdown menus were inaccessible, flash interactions were also hit-or-miss...At first I blamed Firefox since Safari exhibited no such issues, but after a bit of trial and error I decided to compile Synergy server from source on my Ubuntu box. I killed the Ubuntu packaged Synergy server and launched my self-compiled binary. The new server resolved all the issues.Another win for open source software...","categories":[],"tags":[{"name":"ubuntu","slug":"ubuntu","permalink":"http://ericsimmerman.com/tags/ubuntu/"},{"name":"synergy","slug":"synergy","permalink":"http://ericsimmerman.com/tags/synergy/"}]},{"title":"Spring MVC's checkboxes tag and support for enum","slug":"2009-02-21-spring-mvc-checkboxes-tag-and-support","date":"2009-02-21T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/02/21/2009-02-21-spring-mvc-checkboxes-tag-and-support/","link":"","permalink":"http://ericsimmerman.com/2009/02/21/2009-02-21-spring-mvc-checkboxes-tag-and-support/","excerpt":"","text":"Using Spring MVC's checkboxes (or radiobuttons) tag to render form inputs for an enum property is easy and clean...once you know how. After a little gnashing of teeth, due to the fact that I needed a specific display order for all options, I found the following solution:Here's the tag in my jsp &lt;form:checkboxes itemValue=&quot;value&quot; itemLabel=&quot;label&quot; path=&quot;user.degrees&quot; items=&quot;${degreeLabels }&quot; /&gt;Here's the way I populated my model map to retain ordering. (I placed this code in my FormController's referenceData method) List labelValues = new ArrayList&lt;LabelValue&gt;(); for (Degree d : Degree.values()) { labelValues.add(new LabelValue(d.name(), d.name())); } Map model = new HashMap(); model.put(&quot;degreeLabels&quot;, labelValues);FYI, I ripped the LabelValue class used above from Matt Riable's excellent Appfuse project. The constructor takes two arguments which are mapped to the properties \"value\" and \"label\" and these properties have the typical pojo getters and setters.You can see from the path on my tag that degrees is a property on my User object...which is the target of my form. Here's what that looks like...I threw in my Hibernate annotations for the curious: private Set&lt;Degree&gt; degrees = new HashSet&lt;Degree&gt;(); @CollectionOfElements @Enumerated(EnumType.STRING) public Set&lt;Degree&gt; getDegrees() { return degrees; } public void setDegrees(Set&lt;Degree&gt; degrees) { this.degrees = degrees; }It's probably obvious, but here's what the Degree enum looks like: public enum Degree { BA,BS,BN,BSW,MA,MS,MBA,MSN,MSW,MD,JD,PhD,PharmD,PsyD,Other;}","categories":[],"tags":[{"name":"java","slug":"java","permalink":"http://ericsimmerman.com/tags/java/"},{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"},{"name":"spring","slug":"spring","permalink":"http://ericsimmerman.com/tags/spring/"}]},{"title":"Hibernate Annotations - IdentifierGenerationException: attempted to assign id from null one-to-one property","slug":"2009-02-18-hibernate-annotations","date":"2009-02-18T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/02/18/2009-02-18-hibernate-annotations/","link":"","permalink":"http://ericsimmerman.com/2009/02/18/2009-02-18-hibernate-annotations/","excerpt":"","text":"While using Hibernate annotations to implement a @OneToOne relationship where the entities are joined by primary key (@PrimaryKeyJoinColumn) I kept encountering a relatively infamous Exception: IdentifierGenerationException: attempted to assign id from null one-to-one propertyI discovered that my issue could easily be resolved by adding \"optional=false\" to the dependent side of the relation. Here's a brief summary of the relevant related code. @Entitypublic class Profile implements Serializable { @OneToOne(mappedBy=&quot;profile&quot;, optional=false, fetch=FetchType.LAZY) public Hospital getHospital() { return hospital; } @Id @GeneratedValue(generator=&quot;foreign&quot;) @GenericGenerator(name=&quot;foreign&quot;, strategy = &quot;foreign&quot;, parameters={ @Parameter(name=&quot;property&quot;, value=&quot;hospital&quot;) }) public Long getId() { return this.id; }}@Entitypublic class Hospital implements Serializable { @OneToOne(cascade = CascadeType.ALL,fetch=FetchType.LAZY) @PrimaryKeyJoinColumn public Profile getProfile() { return profile; } @Id @GeneratedValue(strategy=GenerationType.AUTO) public Long getId() { return id; }}","categories":[],"tags":[{"name":"java","slug":"java","permalink":"http://ericsimmerman.com/tags/java/"},{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"},{"name":"hibernate","slug":"hibernate","permalink":"http://ericsimmerman.com/tags/hibernate/"}]},{"title":"Import stock sales from Microsoft Money into TurboTax Online","slug":"2009-02-08-import-stock-sales-from-microsoft-money","date":"2009-02-08T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/02/08/2009-02-08-import-stock-sales-from-microsoft-money/","link":"","permalink":"http://ericsimmerman.com/2009/02/08/2009-02-08-import-stock-sales-from-microsoft-money/","excerpt":"","text":"TurboTax Online's investment sale (stock, mutual fund, etc sales for capital gains) entry screen is a nice example of braindead design. Although the application provides a \"bulk-entry spreadsheet-like interface\", there's no import function available. So despite having all of my data in a nice spreadsheet (exported from the MS Money capital gains report) I was still faced with the prospect of manually entering each field from dozens of transactions. Worse still, the interface limits your access to seven rows/transactions per page.Applescript to the rescue! It's an ugly solution, but it saved me a ton of time and helped avoid any manual entry typos:Use your spreadsheet program to arrange your transaction data into columns matching those in TurboTax's interface. You should have five columns. Insure that the dates are formatted as mm/dd/yyCopy and paste the data into your favorite text editor as tab-delimited text (I used the excellent TextMate)Use search and replace to convert all the tabs into &quot; &amp; tab &amp; &quot;Use search and replace to insert the following at the beginning of every line keystroke &quot;Use search and replace to insert the following at the end of every line &quot; &amp; tabNow each line should look something like this keystroke &quot;ACME Stock&quot; &amp; tab &amp; &quot;11/10/08&quot; &amp; tab &amp; &quot;100.12&quot; &amp; tab &amp; &quot;1/12/05&quot; &amp; tab &amp; &quot;584.12&quot; &amp; tabPaste the following script into the Script Editor application on your Mac tell application &quot;System Events&quot; tell process &quot;Firefox&quot;--Clearly replace Firefox above if you are using a different browser set frontmost to true--Transactions go here end tellend tellCut 7 lines at a time from your text editor, paste them into the Script Editor and click \"Run\"The script will populate the TurboTax screen with your data. Click \"Add more Rows\" in TurboTax and repeat!You're welcome.","categories":[],"tags":[{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"}]},{"title":"Cisco VPN - Fix for Error 51: Unable to communicate with the VPN subsystem","slug":"2009-01-28-cisco-vpn-fix-for-error-51-unable-to","date":"2009-01-28T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/01/28/2009-01-28-cisco-vpn-fix-for-error-51-unable-to/","link":"","permalink":"http://ericsimmerman.com/2009/01/28/2009-01-28-cisco-vpn-fix-for-error-51-unable-to/","excerpt":"","text":"I run Leopard on my Mac and encountered the dreaded Error 51 issue today. The simple fix that worked for me was to run the following two commands as root: # ifconfig fw0 down# /System/Library/StartupItems/CiscoVPN/CiscoVPN restartAfterwords, the VPN client started just fine...no Error 51.","categories":[],"tags":[{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"},{"name":"vpn","slug":"vpn","permalink":"http://ericsimmerman.com/tags/vpn/"}]},{"title":"Linksys WET54G bridge to Verizon FiOS ActionTec wireless access point","slug":"2009-01-19-linksys-wet54g-bridge-to-verizon-fios","date":"2009-01-19T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2009/01/19/2009-01-19-linksys-wet54g-bridge-to-verizon-fios/","link":"","permalink":"http://ericsimmerman.com/2009/01/19/2009-01-19-linksys-wet54g-bridge-to-verizon-fios/","excerpt":"","text":"So my upgrade to Verizon FiOS included swapping my Linksys WRT54G access point for the Verizon branded ActionTec device that came with the FiOS install. This swap wasn't strictly necessary, but the ActionTec doubles as both the router and access point so I decided I might as well make use of the wireless capabilities since I have to keep it plugged in either way.The only problem I encountered was that my Linksys WRT54G bridge couldn't play nice with the ActionTec. Through trial and error I found that setting both devices to encrypt using WPA2-PSK using AES only (not the default TKIP+AES) resolved my issues.","categories":[],"tags":[{"name":"networks","slug":"networks","permalink":"http://ericsimmerman.com/tags/networks/"}]},{"title":"Removing duplicate music files with different names from a large directory free","slug":"2008-10-28-removing-duplicate-music-files-with","date":"2008-10-28T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2008/10/28/2008-10-28-removing-duplicate-music-files-with/","link":"","permalink":"http://ericsimmerman.com/2008/10/28/2008-10-28-removing-duplicate-music-files-with/","excerpt":"","text":"During a recent Mac migration, I hosed my iTunes library and unintentionally generated hundreds of duplicate songs (the actual media files). The problem was exacerbated by the fact that a numeric was generally appended to the duplicate filenames so that I had directories full of files like the following: /artist/album/song.mp3/artist/album/song 1.mp3/artist/album/song 2.mp3Apple wasn't doing me any favors by injecting a space in the new names either....what a mess!I stole a few ideas from this excellent forum thread and cobbled together a script to remove files based on exact byte counts and md5sum signatures. Here's the good stuff: #!/bin/bashfind . ! -empty -type f -printf &quot;%s &quot; -exec ls -dQ {} ; | sort -n | cut -d&quot; &quot; -f2- | xargs md5sum | sort | uniq -w32 -d | cut -c35- | while read filenamedo echo &quot;Removing $filenamen&quot; rm &quot;$filename&quot;doneNow here's the play-by-play:Prints out the size and filename of each file found on the path and sorts using the filesize as the keyTrims off the file size in preparation for next stageCreates the checksum for the files of the same size and then sorts by resultStrip out any checksums that are unique, leaving only the duplicatesStrips out the checksum part, just leaving the duplicate filenamesLoops through the results removing the first duplicate file of each set.You'll need to run the script multiple times if you've managed to generate more than one copy of any given file. Good luck!","categories":[],"tags":[{"name":"ubuntu","slug":"ubuntu","permalink":"http://ericsimmerman.com/tags/ubuntu/"}]},{"title":"Running Synergy client automatically under Mac OS X 10.5","slug":"2008-09-17-running-synergy-client-automatically","date":"2008-09-17T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2008/09/17/2008-09-17-running-synergy-client-automatically/","link":"","permalink":"http://ericsimmerman.com/2008/09/17/2008-09-17-running-synergy-client-automatically/","excerpt":"","text":"There is a bug in Synergy 1.3.1 causing it to crash when started as a daemon under Mac OS X 10.5.Here's the fix you want.","categories":[],"tags":[{"name":"macintosh","slug":"macintosh","permalink":"http://ericsimmerman.com/tags/macintosh/"},{"name":"synergy","slug":"synergy","permalink":"http://ericsimmerman.com/tags/synergy/"}]},{"title":"avahi-daemon blocks nfsd on Ubuntu","slug":"2008-06-06-avahi-daemon-blocks-nfsd-on-ubuntu","date":"2008-06-06T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2008/06/06/2008-06-06-avahi-daemon-blocks-nfsd-on-ubuntu/","link":"","permalink":"http://ericsimmerman.com/2008/06/06/2008-06-06-avahi-daemon-blocks-nfsd-on-ubuntu/","excerpt":"","text":"I just spent a morning attempting to fix a NFS mounting configuration that had been working flawlessly for over 6 months. My daemon log was showing this: nfssvc: writing fds to kernel failed: errno 98 (Address already in use)After much angst, I finally stumbled upon this posting that mentioned a conflict between avahi-daemon and NFSd. After a quick \"apt-get remove avahi-daemon\", all is well with the world.","categories":[],"tags":[{"name":"ubuntu","slug":"ubuntu","permalink":"http://ericsimmerman.com/tags/ubuntu/"}]},{"title":"MathML support in OpenLaszlo","slug":"2008-06-05-mathml-support-in-openlaszlo","date":"2008-06-05T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2008/06/05/2008-06-05-mathml-support-in-openlaszlo/","link":"","permalink":"http://ericsimmerman.com/2008/06/05/2008-06-05-mathml-support-in-openlaszlo/","excerpt":"","text":"I'm happy to announce that my company (Tempest Strings Enterprises) has sponsored my development and release of a MathML library for OpenLaszlo. I'll be working through the OpenLaszlo contributor process, but imagine that it could take a considerable amount of time before you see this work in their repository since I've not yet made any effort to adhere to any coding guidelines. There is very little documentation in the source, no consistent style, and no support for any runtime except SWF. Nevertheless, I've already successfully integrated the library with a larger application and it is functioning well in our beta release.This library is based upon the Flash Actionscript library that ionel-alexandru (Sourceforge username) of learn-math.info donated to the public domain. I make heavy use of Alex's object tree and MathML rendering logic (thanks Alex!). I've built upon OpenLaszlo's Drawview class from their SVN trunk and added support for rendering stand-alone MathML from a datasource as well as formulas placed inline with other text.Note that the full set of MathML has not yet been implemented (ex: no support for &lt;mtable&gt;) but here are some examples of supported formulas: &lt;dataset name=&quot;example1&quot;&gt;&lt;math&gt;&lt;mrow&gt;&lt;msqrt&gt; &lt;mrow&gt; &lt;msup&gt; &lt;mn&gt;2&lt;/mn&gt; &lt;mrow&gt; &lt;msup&gt; &lt;mi&gt;x&lt;/mi&gt; &lt;mn&gt;2&lt;/mn&gt; &lt;/msup&gt; &lt;mo&gt;+&lt;/mo&gt; &lt;mrow&gt; &lt;mn&gt;4&lt;/mn&gt; &lt;mi&gt;x&lt;/mi&gt; &lt;/mrow&gt; &lt;mo&gt;+&lt;/mo&gt; &lt;mn&gt;4&lt;/mn&gt; &lt;/mrow&gt; &lt;/msup&gt; &lt;mo&gt;+&lt;/mo&gt; &lt;mrow&gt; &lt;mn&gt;4&lt;/mn&gt; &lt;mi&gt;x&lt;/mi&gt; &lt;/mrow&gt; &lt;mo&gt;+&lt;/mo&gt; &lt;mn&gt;45&lt;/mn&gt; &lt;/mrow&gt;&lt;/msqrt&gt;&lt;mo&gt;+&lt;/mo&gt;&lt;mroot linethickness=&quot;3&quot;&gt;&lt;mrow&gt; &lt;msub&gt; &lt;mi&gt;log&lt;/mi&gt; &lt;mn&gt;2&lt;/mn&gt; &lt;/msub&gt;&lt;/mrow&gt;&lt;mi&gt;5&lt;/mi&gt;&lt;/mroot&gt;&lt;/mrow&gt;&lt;/math&gt;&lt;/dataset&gt;renders with the library as: &lt;dataset name=&quot;example2&quot;&gt;&lt;math&gt; &lt;mrow&gt; &lt;mo&gt; ( &lt;/mo&gt; &lt;mfrac linethickness=&quot;0&quot; color=&quot;#006699&quot;&gt; &lt;mi fontstyle=&quot;bold&quot;&gt; a + b +c &lt;/mi&gt; &lt;mi color=&quot;#ff0000&quot;&gt; b &lt;/mi&gt; &lt;/mfrac&gt; &lt;mo&gt; ) &lt;/mo&gt; &lt;/mrow&gt; &lt;mfrac linethickness=&quot;2&quot; fontstyle=&quot;italic&quot; &gt; &lt;mrow&gt;&lt;mi color=&quot;#00ff00&quot;&gt;3456&lt;/mi&gt;&lt;mo&gt;+&lt;/mo&gt;&lt;mfrac&gt; &lt;mi&gt; a &lt;/mi&gt; &lt;mi fontsize=&quot;8&quot;&gt; b + c + d&lt;/mi&gt; &lt;/mfrac&gt; &lt;/mrow&gt;&lt;mrow&gt;&lt;mn&gt;3&lt;/mn&gt; &lt;mfrac color=&quot;#ffff00&quot;&gt; &lt;mi&gt; c + d &lt;/mi&gt; &lt;mi color=&quot;#ff0000&quot;&gt; d &lt;/mi&gt; &lt;/mfrac&gt; &lt;/mrow&gt; &lt;/mfrac&gt;&lt;/math&gt;&lt;/dataset&gt;makes use of node-level styling to render asThe next one really shows off some of the fancy rendering capabilities: &lt;dataset name=&quot;example3&quot;&gt;&lt;math&gt; &lt;msubsup&gt; &lt;mo&gt;&lt;![CDATA[???]]&gt;&lt;/mo&gt;&lt;mn&gt;2&lt;/mn&gt;&lt;mn&gt;56&lt;/mn&gt; &lt;/msubsup&gt; &lt;msup&gt; &lt;mi&gt;x&lt;/mi&gt; &lt;mn&gt;2&lt;/mn&gt; &lt;/msup&gt; &lt;mtext fontstyle='italic'&gt;dx&lt;/mtext&gt;&lt;mo&gt;+&lt;/mo&gt; &lt;msubsup&gt; &lt;mo&gt;&lt;![CDATA[???]]&gt;&lt;/mo&gt; &lt;mi&gt;-&lt;![CDATA[&amp;infinity;]]&gt;&lt;/mi&gt; &lt;mi&gt;&lt;![CDATA[&amp;infinity;]]&gt;&lt;/mi&gt; &lt;/msubsup&gt; &lt;msup&gt; &lt;mi&gt;e&lt;/mi&gt; &lt;mn&gt;x&lt;/mn&gt; &lt;/msup&gt; &lt;mtext fontstyle='italic'&gt;dx&lt;/mtext&gt;&lt;mo&gt;+&lt;/mo&gt; &lt;munderover&gt; &lt;mo&gt;&lt;![CDATA[???]]&gt;&lt;/mo&gt; &lt;mrow&gt; &lt;mi&gt;x&lt;/mi&gt; &lt;mo&gt;=&lt;/mo&gt; &lt;mn&gt;0&lt;/mn&gt; &lt;/mrow&gt; &lt;mn&gt;56&lt;/mn&gt; &lt;/munderover&gt; &lt;msup&gt; &lt;mi&gt;x&lt;/mi&gt; &lt;mn&gt;2&lt;/mn&gt; &lt;/msup&gt; &lt;mo&gt;+&lt;/mo&gt; &lt;munderover&gt; &lt;mo&gt;&lt;![CDATA[???]]&gt;&lt;/mo&gt; &lt;mrow&gt; &lt;mi&gt;x&lt;/mi&gt; &lt;mo&gt;=&lt;/mo&gt; &lt;mn&gt;0&lt;/mn&gt; &lt;/mrow&gt; &lt;mi&gt;&lt;![CDATA[&amp;infinity;]]&gt;&lt;/mi&gt; &lt;/munderover&gt; &lt;msup&gt; &lt;mi&gt;x&lt;/mi&gt; &lt;mn&gt;2&lt;/mn&gt; &lt;/msup&gt; &lt;mo&gt;+&lt;/mo&gt; &lt;munderover&gt; &lt;mo&gt;&lt;![CDATA[???]]&gt;&lt;/mo&gt; &lt;mrow&gt;&lt;mi&gt;x&lt;/mi&gt;&lt;mo&gt;=&lt;/mo&gt;&lt;mn&gt;1&lt;/mn&gt;&lt;/mrow&gt; &lt;mi&gt;n&lt;/mi&gt;&lt;/munderover&gt;&lt;mrow&gt; &lt;mi&gt;x&lt;/mi&gt;&lt;/mrow&gt;&lt;mo&gt;+&lt;/mo&gt; &lt;munder&gt; &lt;mrow&gt; &lt;mi&gt;lim&lt;/mi&gt; &lt;/mrow&gt; &lt;mrow&gt; &lt;mi&gt;x&lt;/mi&gt; &lt;mo&gt;&lt;![CDATA[???]]&gt;&lt;/mo&gt; &lt;mn&gt;0&lt;/mn&gt; &lt;/mrow&gt;&lt;/munder&gt;&lt;mrow&gt; &lt;mi&gt;x&lt;/mi&gt;&lt;/mrow&gt;&lt;/math&gt;&lt;/dataset&gt;This last example is demonstrating inline rendering with text: &lt;dataset name=&quot;myFormula&quot;&gt;&lt;![CDATA[This is an example of pseudo inline MathML:&lt;math&gt; &lt;mrow&gt; &lt;mi&gt;x&lt;/mi&gt; &lt;mo&gt;+&lt;/mo&gt; &lt;msup&gt; &lt;mi&gt;y&lt;/mi&gt; &lt;mfrac&gt; &lt;mn&gt;2&lt;/mn&gt; &lt;mrow&gt; &lt;mi&gt;k&lt;/mi&gt; &lt;mo&gt;+&lt;/mo&gt; &lt;mn&gt;1&lt;/mn&gt; &lt;/mrow&gt; &lt;/mfrac&gt; &lt;/msup&gt; &lt;/mrow&gt; &lt;/math&gt;How do you like them apples?]]&gt;&lt;/dataset&gt;All of the formulas above were displayed using the same MathML view using the datasets listed. Here's the view declaration: &lt;mathmlview font=&quot;sans-serif&quot; fontsize=&quot;24&quot; fgcolor=&quot;#000000&quot; id=&quot;math&quot; x=&quot;10&quot; y=&quot;10&quot; width=&quot;800&quot; height=&quot;500&quot; datapath=&quot;myFormula:/&quot;/&gt;The current source is released under the MIT Open Source License and available on github. Enjoy!","categories":[],"tags":[{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"},{"name":"openlaszlo","slug":"openlaszlo","permalink":"http://ericsimmerman.com/tags/openlaszlo/"},{"name":"mathml","slug":"mathml","permalink":"http://ericsimmerman.com/tags/mathml/"}]},{"title":"Spring JMS Remoting support for async calls and methods with void return types","slug":"2008-05-28-spring-jms-remoting-support-for-async","date":"2008-05-28T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2008/05/28/2008-05-28-spring-jms-remoting-support-for-async/","link":"","permalink":"http://ericsimmerman.com/2008/05/28/2008-05-28-spring-jms-remoting-support-for-async/","excerpt":"","text":"I've submitted a patch to the Spring Framework to give their JMS remoting feature support for async calls and methods with void return types. The associated Jira ticket (SPR-4427) could use a few votes if you are so inclined.","categories":[],"tags":[{"name":"java","slug":"java","permalink":"http://ericsimmerman.com/tags/java/"},{"name":"softwaredevelopment","slug":"softwaredevelopment","permalink":"http://ericsimmerman.com/tags/softwaredevelopment/"},{"name":"spring","slug":"spring","permalink":"http://ericsimmerman.com/tags/spring/"}]},{"title":"Hilight current post on threaded view in Fireboard 1.0.4","slug":"2008-01-15-hilight-current-post-on-threaded-view","date":"2008-01-15T05:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2008/01/15/2008-01-15-hilight-current-post-on-threaded-view/","link":"","permalink":"http://ericsimmerman.com/2008/01/15/2008-01-15-hilight-current-post-on-threaded-view/","excerpt":"","text":"In the 1.0.4 release, there is no indicator of which post you are currently viewing within a threaded tree of posts. Here's my hack to implement such an indicator.Under your chosen template directory (ex: components/com_fireboard/templates/default), edit the thread.php file. Look for the TR with class=\"fb_threadview_row\" and modify it like so: &lt;tr class=&quot;fb_threadview_row&quot; &lt;? if($leaf-&gt;id == (int)$id){ echo &quot;style='background-color:yellow'&quot;; } ?&gt; &gt;You can use any background-color value you desire. I used \"yellow\" in the above example.","categories":[],"tags":[]},{"title":"Java webbrowser plugin for AMD64 Ubuntu","slug":"2007-10-29-java-webbrowser-plugin-for-amd64-ubuntu","date":"2007-10-29T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2007/10/29/2007-10-29-java-webbrowser-plugin-for-amd64-ubuntu/","link":"","permalink":"http://ericsimmerman.com/2007/10/29/2007-10-29-java-webbrowser-plugin-for-amd64-ubuntu/","excerpt":"","text":"There is now (finally) a fix for Java applet support on AMD64 Ubuntu. Try the following: sudo apt-get build-dep icedtea-java7-pluginsudo apt-get -b source icedtea-java7-plugin icedtea-java7-bin icedtea-java7-jre icedtea-java7-jdksudo dpkg -i icedtea-java7-*debThanks to Fabien Lusseau for the tip in his comment here","categories":[],"tags":[{"name":"ubuntu","slug":"ubuntu","permalink":"http://ericsimmerman.com/tags/ubuntu/"},{"name":"java","slug":"java","permalink":"http://ericsimmerman.com/tags/java/"}]},{"title":"Mounting an Ubuntu NFS share on RedHat Enterprise with firewalls on both","slug":"2007-10-20-mounting-ubuntu-nfs-share-on-redhat","date":"2007-10-20T04:00:00.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2007/10/20/2007-10-20-mounting-ubuntu-nfs-share-on-redhat/","link":"","permalink":"http://ericsimmerman.com/2007/10/20/2007-10-20-mounting-ubuntu-nfs-share-on-redhat/","excerpt":"","text":"It can be tough making NFS play nice amongst different distros and firewalls. I'm sharing my Eclipse workspace on my Ubuntu (Debian) desktop with my CentOS (Redhat Enterprise) server. (That's not a mistake, my server is actually my NFS client in this scenario. You could easily swap these roles if you wish) DEBIAN:I used port numbers and config instructions at http://wiki.debian.org/?SecuringNFSFollow those instructions exactly and you'll have a NFS server configuration that uses static ports (instead of random assignements)REDHAT:1. Create the file &quot;/etc/sysconfig/nfs&quot; and add the following contents:STATD_PORT=32765STATD_OUTGOING_PORT=32766LOCKD_TCPPORT=32768LOCKD_UDPPORT=32768MOUNTD_PORT=327672. (Probably not necessary for most, but here for completeness) Append the following to the file &quot;/etc/services&quot;:rquotad 32769/tcp # rpc.rquotad tcp portrquotad 32769/udp # rpc.rquotad udp port3. Restart the nfslock service:/etc/init.d/nfslock restart4. Run /usr/sbin/rpcinfo -p and make sure all the ports above have changed and match their ubuntu numbers. (/usr/bin/rpcinfo on ubuntu)5. I run firestarter on Ubuntu which is exporting my NFS share. I added the following policy rules for inbound traffic:Allow 32767 (from my client machine's IP)Allow 2049 (from my client machine's IP)Allow 111 (from my client machine's IP)Assuming you allow all outbound traffic on your client (I recommend this excellent iptables config file rc.firewall_023.txt), you should now be able to mount the NFS share on the Redhat box.","categories":[],"tags":[{"name":"ubuntu","slug":"ubuntu","permalink":"http://ericsimmerman.com/tags/ubuntu/"}]},{"title":"Migrated from JRoller","slug":"2006-01-01-migrated-from-jroller","date":"2006-01-01T15:35:32.000Z","updated":"2021-09-07T14:56:47.000Z","comments":true,"path":"2006/01/01/2006-01-01-migrated-from-jroller/","link":"","permalink":"http://ericsimmerman.com/2006/01/01/2006-01-01-migrated-from-jroller/","excerpt":"","text":"Entries prior to October 2007 are only available on my original Agile Answers blog hosted at JRoller here.","categories":[],"tags":[]}]}